import React from 'react';



export default async function PackageDetails({
    params,
}: {
    params: Promise<{ slug: string }>
}) {
    const slug = (await params).slug
    console.log(slug)
    const tourPackages = [
        {
            slug: "student-package",
            content: <div>
                <img className="w-full h-80 md:h-96 mb-5 object-cover" src="/blog/Blog_01.jpg" />
                <h1 className="text-2xl font-bold mb-5 px-5 md:px-0">আল আযহার পরিচিত</h1>
                <div className=' px-5 md:px-0'>
                    <p className=" text-justify" ><strong>পরিচিতি:</strong> আল – আযহার মসজিদ ইসলামি বিশ্বের অন্যতম বিখ্যাত ও প্রাচীন একটি মসজিদ। মিশরের সর্বাধিক প্রাচীন মসজিদগুলোর মধ্যে সবচেয়ে গুরুত্বপূর্ণ মসজিদ এটি। ইসলাম ও মুসলমাদের ঐতিহাসিক একটি দুর্গ। যা কাবাতুল ইলম নামে খ্যাত। ইসলামি সভ্যতার প্রাণকেন্দ্র। কায়রো নগরীর আদ—দারবুল আহমার এলাকায় সহস্রাধিক বছর ধরে দাঁড়িয়ে আছে ইসলামি শিক্ষা ও সভ্যতার এই অতন্দ্র প্রহরী। এই মসজিদকে কেন্দ্র করেই গড়ে ওঠে আজকের বিশ্ব বিখ্যাত আল-আযহার বিশ্ববিদ্যালয়। মসজিদটি প্রতিষ্ঠালগ্ন থেকে অদ্যাবধি নিরবচ্ছিন্নভাবে মুসলিম উম্মাহর মাঝে ইলমে নববির মশাল প্রজ্বলিত রেখেছে।</p>
                    <br />
                    <p className=" text-justify" ><strong>আল আযহার প্রতিষ্ঠার সময়কাল:</strong> ৩৫৯ হিজরির ২৪ জুমাদাল উলা মোতাবেক ৯৭১ খ্রিস্টাব্দের ৭ই মে ধর্মীয় ও রাজনৈতিক কর্মকাণ্ড পরিচালনার জন্য খলিফা আল-মুইয লিদিনিল্লাহ-এর নির্দেশে বর্তমান কায়রো শহরে আল-আযহার মসজিদের নির্মাণ কাজ শুরু করা হয়। তার ঠিক দুই বছর পর খলিফা নতুন বিজিত অঞ্চল মিশরে আগমন করেন। তিনি শহরের নাম রাখেন ‘কাহেরা’ এবং কাহেরাকে ফাতেমি খেলাফতের রাজধানী হিসেবে ঘোষণা করেন। একই বছর ৩৬১ হিজরিতে আল-আযহার মসজিদে প্রথম জুমার নামাজ আদায় করে সুলতান মসজিদটিকে মিশরের কেন্দ্রীয় মসজিদ ও শিয়া ইসমাঈলিদের শিক্ষা-দীক্ষার প্রধান কেন্দ্র হিসেবে ঘোষণা করেন।</p>
                    <br />
                    <p className=" text-justify" ><strong>ফাতেমি শাসনামলে আল-আযহার:</strong> যেহেতু ফাতেমিরা আল-আযহার প্রতিষ্ঠা করেছিল রাজনৈতিক ও ধর্মীয় সুবিধার্থে; তাই প্রতিষ্ঠার পর থেকেই মিশরে শিয়া মতবাদের প্রচার-প্রসার ঘটতে থাকে। শিয়া ইসমাঈলি ফিকহের প্রতিষ্ঠাতা আল-মুইয লিদিনিল্লাহ-এর শিয়া বিচারক আবু হানিফা ইবনে মুহাম্মদ আল- কায়রাওয়ানিকে আল-আযহারের সর্বপ্রথম শিক্ষক হিসেবে নিয়োগ দেয়া হয়। তারপর ধারাবাহিকভাবে তার সন্তান ও অন্যান্য শিয়া আলেমরাও জামিউল আযহারে শিক্ষা-দীক্ষার দায়িত্ব পালন করেন। প্রতিষ্ঠাকাল থেকেই মসজিদটিতে শিয়া আকিদা, ফিকহ ও অন্যান্য দীনি শাস্ত্রের পাশাপাশি আরবি ভাষা, ইলমুল কিরাআত, মানতেক ও জ্যোতির্বিদ্যা শিক্ষাদান করা হতো। পাঠ্যপুস্তকে সর্বাধিক গুরুত্ব পেতো শিয়াদের রচিত গ্রন্থাবলি। কিছুকাল না গড়াতেই জামিউল আযহার শিয়া ইসমাঈলিদের আকিদা-বিশ্বাস প্রচার-প্রসারে গুরুত্বপূর্ণ ভূমিকা রাখতে শুরু করে।</p>
                    <br />
                    <p className=" text-justify" >মিশরে আল-আযহারের পূর্বে আরও দুটি মসজিদ স্থাপিত হয়েছিলো। জামিউ আমর ইবনুল আস ও জামিউ আহমদ ইবনে তুলুন। প্রাচীন এই দুই মসজিদকেও দেওয়া হয়েছিলো শিক্ষাকেন্দ্রের রূপ। এ ছাড়াও সরকারিভাবে আরও অনেক শিক্ষাকেন্দ্র গড়ে তোলা হয়েছিলো। যার সবগুলোই পরিচালিত হতো তদানীন্তন ফাতেমি শাসকদের তত্ত্বাবধানে। এই সময়টাতে আহলুস সুন্নাহ ওয়াল জামাআহ পরিণত হয়েছিলো সংখ্যালঘু জনগোষ্ঠিতে। এ সময়ে বহু উলামায়ে কেরাম মিশর থেকে বিভিন্ন দেশে হিজরত করেন।</p>
                    <br />
                    <p className=" text-justify" ><strong>আইউবি যুগে আল আযহার:</strong> ১১৭১ খ্রিস্টাব্দে (৫৬৭ হিজরি) সুলতান সালাহুদ্দিন আইউবির হাতে মিশরে ফাতেমিদের পতন হয়। পৃথিবী থেকে চিরতরে বিলীন হয়ে যায় ফাতেমি শাসনব্যবস্থা। মিশরের ক্ষমতায় আসীন হন সুলতান সালাহুদ্দিন আইউবি। তিনি ছিলেন আহলুস সুন্নাহ ওয়াল জামাআতের মতাদর্শে বিশ্বাসী। তিনি শিয়া মতাদশের্র প্রতি বিরূপ মনোভাব পোষণ করতেন। তিনিই মিশর থেকে শিয়া মতবাদ উৎখাত করে আহলুস সুন্নাহ ওয়াল জামাআতের মতাদর্শে মিশরকে পুনরায় ঢেলে সাজান। এ কাজটি তিনি অতি দূরদর্শিতা ও বিচক্ষণতার সঙ্গে সম্পন্ন করেন। যেহেতু আল-আযহার মসজিদ তখন ছিলো ফাতেমিদের প্রাণকেন্দ্র ও শিয়াদের সর্বোচ্চ শিক্ষাকেন্দ্র; তাই মিশর থেকে শিয়া মতাদশের্র প্রভাব নিশ্চিহ্ন ও উৎখাত এবং তাদের রীতিনীতি মিশর থেকে নির্মূল করতে তখনকার আল-আযহার মসজিদ থেকে মিশরবাসীদের দৃষ্টি ফিরিয়ে নেওয়ার জন্য সুলতান সালাহুদ্দিন আইয়ুবি আল-আযহার মসজিদের কার্যক্রমের উপর সীমাবদ্ধতা আরোপের সিদ্ধান্ত নেন। সুলতান সালাহউদ্দিন কর্তৃক নিযুক্ত কাজি সদরউদ্দিন ইবনু দিরবাস এখানে জুমার নামাজের জামাতের উপর নিষেধাজ্ঞা জারি করেন। এই সিদ্ধান্তটি ছিলো সালাহুদ্দিন আইউবির যুগান্তকারী সিদ্ধান্ত ও বিচক্ষণতার পরিচয়। এতে যে কল্যাণকর বিষয়গুলো পরিদৃষ্ট হয়েছে, তার মধ্যে অন্যতম হলো- ফাতেমি যুগে মিশর থেকে হিজরত করা উলামায়ে কেরামের পুনরায় মিশর প্রত্যাবর্তন</p>
                    <br />
                    <p className=" text-justify" ><strong>আল আযহারের উপর নিষেধাজ্ঞা আরোপের প্রভাব:</strong> আল-আযহার মসজিদের উপর সীমাবদ্ধতা আরোপের পর থেকে মসজিদটি তার গুরুত্ব হারাতে শুরু করে। নিয়মতান্ত্রিক পাঠদান বন্ধ হয়ে যাওয়ায় ফাতেমি যুগে দায়িত্বপালনকারী শিক্ষকরা অন্য পেশায় চলে যেতে বাধ্য হন। তবে এরপরও আল-আযহার এসময় একটি শিক্ষাকেন্দ্র হিসেবে টিকে ছিল। নিয়মতান্ত্রিক পাঠদান বন্ধ থাকলেও ব্যক্তিগত উদ্যোগে আল-আযহার মসজিদে পাঠদান করা হত। একটি মতানুযায়ী আবদুল লতিফ আল-বাগদাদি মসজিদে আইন ও চিকিৎসাসহ বেশ কিছু বিষয়ে শিক্ষা প্রদান করতেন। তিনি রাষ্ট্রীয় বেতনভুক্ত ছিলেন। সালাহউদ্দিন আইউবি আল-আযহার মসজিদের মিহরাবে যুক্ত ফাতেমি খলিফাদের নামাঙ্কিত একটি রৌপ্য পাত খুলে ফেলার নির্দেশ দিয়েছিলেন। আল-আযহার ও অন্যান্য মসজিদ থেকে খুলে ফেলা অণুরূপ পাতের মূল্য দাঁড়ায় ৫,০০০ দিরহাম। তবে সালাহউদ্দিন আইউবী স¤পূর্ণভাবে মসজিদটিকে উপেক্ষা করেননি। মসজিদের একটি মিনার সালাহুদ্দিনের শাসনামলে নির্মিত হয়েছিল। আইউবীয় শাসকরা মিসরে আহলুস সুন্নাহ ওয়াল জামাতের মতাদর্শ প্রতিষ্ঠার জন্য কায়রোজুড়ে আরও অনেক মসজিদ ও প্রায় ২৬টি মাদ্রাসা স্থাপন করেছিলেন। এ সব প্রতিষ্ঠান রাষ্টীয় পৃষ্ঠপোষকতায় পরিচালিত হতো।</p>
                    <br />
                    <p className=" text-justify" ><strong>মামলুক শাসনামলে আল-আযহার:</strong> আইউবি শাসনের পর মিশরে শুরু হয় মামলুকদের শাসনামল। তারা ১২৫০- ১৫১৭ খ্রিস্টাব্দ (৬৪৮-৯২৩ হিজরী) পর্যন্ত মিসর শাসন করে। আইউবি শাসনামলের পুরো সময়টাই আল-আযহার মসজিদে জুমার নামাজ বন্ধ ছিল। মামলুক সালতানাতের সতেরো বছর পর চতুর্থ মামলুক শাসক, উম্মাহর ইতিহাসের এক উজ্জ্বল নক্ষত্র সুলতান যহির রুকনুদ্দিন বাইবার্স আল-আযহার মসজিদ সংস্কারের নির্দেশ দেন। তিনি সংস্কারের জন্য প্রয়োজনীয় অর্থেরও ব্যবস্থা করেন। সেই সাথে সুলতান বাইবার্স ২৬৭ খ্রিস্টাব্দে (৬৬৫ হি.) ৯৮ বছর পর পুনরায় আল—আযহার মসজিদে আহলুস সুন্নাহ ওয়াল জামাআতের মানহাজের জুমার নামাজ ও শিক্ষাকার্যক্রম চালু করেন। আল-আযহার পুনর্জন্ম লাভ করে। আল-আযহার তার স্বর্ণযুগে প্রবেশ করে। শুরু হয় আল-আযহার মসজিদের নতুন অধ্যায়। গৌরবময় সোনালী ইতিহাসের সূচনা। আল-আযহার সেই সপ্তম শতাব্দী হতে আজ পর্যন্ত আহলুস সুন্নাহ ওয়াল জামাআতের ইলমি মারকাজ। জ্ঞান-বিজ্ঞানের প্রাণকেন্দ্র। আল-আযহারের সাথে ওতপ্রোতভাবে জড়িয়ে আছে মুসলিম উম্মাহর গৌরবের ইতিহাস।</p>
                    <p className=" text-justify" >মামলুকদের শাসনামলে আল-আযহার মসজিদে ব্যাপক উন্নয়ন হয়েছিল। মামলুকরা মাদ্রাসার শিক্ষার্থীদের বৃত্তি ও শিক্ষকদের বেতন পুনর্বহাল করেন। মামলুক সুলতানগণ আল-আযহারে শিক্ষাকার্যক্রম ফিরিয়ে আনেন। মামলুক শাসনের শেষ পর্যন্ত উচ্চপদস্থ সরকারি কর্মকর্তারা মসজিদের সরাসরি পৃষ্ঠপোষকতা করেছেন। সুলতানগণ আল-আযহার মসজিদের সাথে ঘনিষ্ঠ স¤পর্ক রাখতেন। মুসলিম বিশ্বের প্রধান শিক্ষাপ্রতিষ্ঠান হিসেবে গণ্য হওয়া এবং রাজকীয় পৃষ্ঠপোষকতা সত্ত্বেও আল-আযহার কায়রোর অন্যান্য মাদ্রাসার মত ছিল না। আল-আযহারে নিজস্ব পন্থায় পাঠদান করা হতো।</p>
                    <br />
                    <p className=" text-justify" ><strong>ইসলামি বিশ্বে আল-আযহারের কেন্দ্রীয় অবস্থান লাভ:</strong> ১২৩৬ থেকে ১২৬১ খ্রিস্টাব্দের মধ্যে আন্দালুসের কর্ডোভা, সেভিল, ভ্যালেনসিয়াসহ বিভিন্ন বড় বড় শহরের পতন হওয়ায় সেখানকার বিখ্যাত উলামায়ে কেরাম বাস্তুহারা হয়ে পড়েন। এরপর ১২৫৮ সালে মোঙ্গলদের হাতে বাগদাদের পতন হয়। তৎকালীন মামলুক সালতানাত মুসলিম বিশ্বের শক্তিশালী রাষ্ট্র হওয়ায় বাগদাদ ও আন্দালুসের জনসাধারণের পাশাপাশি বিখ্যাত উলামায়ে কেরামও মিশরে আশ্রয় গ্রহণ করেন। ফলে মুসলিম বিশ্বে কায়রোর গুরুত্ব বৃদ্ধি পায়। বাগদাদ ও আন্দালুসের সেইসব বিখ্যাত উলামায়ে কেরাম আল—আযহারে এসে ইসলামি জ্ঞান চর্চায় নিমগ্ন হন। আল—আযহার তৎকালীন ইসলামি বিশ্বের সর্বশ্রেষ্ঠ ও কেন্দ্রীয় শিক্ষা প্রতিষ্ঠানে পরিণত হয়। মামলুক শাসনামলে বিশ্বের সমসাময়িক বিখ্যাত উলামায়ে কেরাম প্রায় সকলেই আল—আযহারে শিক্ষকতা করতেন অথবা কোনো এক সময়ে আল—আযহারে স্বল্প সময়ের জন্য এসেছিলেন।</p>
                    <br />
                    <p className=" text-justify" >মামলুক শাসনামলে আল—আযহারে শিক্ষকতা করা প্রখ্যাত আলেমদের মধ্যে অন্যতম হলেন, ইমাম ইবনে হাজার আল—আসকালানি, ইমাম বদর উদ্দীন আল—আইনি, ইমাম জালালুদ্দীন আস—সুয়ূতি, আল্লামা আবদুর রহমান ইবনে খালদুন, তাকি উদ্দীন আহমদ আল—মাকরিজি প্রমুখ।</p>
                    <br />
                    <p className=" text-justify" >মামলুক শাসনামলে শিক্ষার্থীদের সংখ্যার দিক থেকে আল—আযহার মিশরের অন্যান্য শিক্ষাপ্রতিষ্ঠানগুলোকে ছাড়িয়ে যায়। মুসলিম বিশ্বের চারিদিক থেকে শিক্ষার্থীরা এখানে আসত। তৎকালে মিশরের উলামাদের একতৃতীয়াংশ এখানে শিক্ষকতা বা লেখাপড়া করেতেন।</p>
                    <br />
                    <p className=" text-justify" ><strong>মামলুক শাসনামলের উল্লেখযোগ্য নির্মাণ কাজ: </strong>আল—আযহার মসজিদে মামলুক শাসনামলের উল্লেখযোগ্য নির্মাণ কাজ হলো, মসজিদের সাথে সংযুক্ত করে বিদেশী এবং মিশরীয় শিক্ষার্থীদের জন্য আবাসনের ব্যবস্থা করা হয়; যা রুওয়াক নামে পরিচিত। এভাবে মসজিদের যাথে সংযুক্ত করে আত—তাইবারসিয়্যা, আস—আকবাগাউয়্যাহ, ও আল—জাওহারিয়া নামে তিনটি মাদ্রাসা স্থাপন করা হয়। যেখানে বিভিন্ন শাস্ত্রের পাঠদান করা হতো।</p>
                    <br />
                    <p className=" text-justify" ><strong>উসমানী শাসনামলে আল—আযহার:</strong> মামলুক শাসনের পর মিশরে শুরু হয় উসমানীদের শাসনামল। মিশর তখন উসমানীয় সাম্রাজ্যের প্রদেশ হয়ে যায়। তারা ১৫১৭—১৭৯৮ খ্রিস্টাব্দ (৯২৩—১২১৩ হি.) পর্যন্ত মিশর শাসন করে। তুর্কিরা আল—আযহার মসজিদকে অনেক সম্মানের প্রদর্শন করতো। উসমানীয় সুলতান প্রথম সেলিম তার মিশরে অবস্থানের শেষ সপ্তাহে আল—আযহার মসজিদে জুমার নামাজ আদায় করেছিলেন। পরবর্তীতে উসমানীয় আমিররা নিয়মিতভাবে আল—আযহার মসজিদে জুমার নামাজ আদায় করতেন। বিভিন্ন উপলক্ষ্যে শিক্ষক ও শিক্ষার্থীদের বৃত্তি প্রদান করতেন। উসমানীয় যুগেও আল—আযহার মসজিদে বেশ কিছু সংস্কার হয়েছিলো।</p>
                    <br />
                    <p className=" text-justify" >উসমানী শাসনামলের তিন শতাব্দী ধরেই সুনামের সাথে আল—আযহার মুসলিম উম্মাহর মাঝে ইসলামি জ্ঞানের আলো বিতরণ করে। উসমানীয় যুগে তা মিশর ও মুসলিম বিশ্বে আরও অধিক জনপ্রিয় শিক্ষাপ্রতিষ্ঠান ও মুসলিম বিশ্বের জন্য কাবাতুল ইলম হয়ে উঠে। এই যুগে আল—আযহারে শাইখুল আযহারের পদের সুচনা হয়। প্রথম শাইখুল আযহার ছিলেন মুহাম্মাদ আল—খুরাশি আল—মালেকি (মৃত্যু : ১১০১ হি.)।</p>
                    <br />
                    <p className=" text-justify" ><strong>যুগে যুগে আল—আযহার মসজিদের স্থাপত্য:</strong> আল—আযহার মসজিদের প্রতিষ্ঠার পর থেকে আজ পর্যন্ত প্রায় প্রতি যুগের শাসকগণ মসজিদের স্থাপত্যে সম্প্রসারণ, নির্মাণ ও সংস্কারের কাজে অংশগ্রহণ করেছেন। তবে বিশেষ করে মামলুক শাসনামলে সবচেয়ে বেশি সংস্কার ও নির্মাণের কাজ হয়েছে। সর্বশেষ সংস্কারের কাজ সমাপ্ত হয়েছে ২০১৮ খ্রিস্টাব্দে (১৪৩৯ হি.)। বর্তমানে মসজিদটির আয়তন প্রায় ১২,০০০ বর্গ মিটার।</p>
                    <br />
                    <p className=" text-justify" ><strong>আল—আযহারের বর্তমান অবকাঠামো:</strong> আল—আযহার বর্তমানে যে সকল অঙ্গ প্রতিষ্ঠানের সমন্বয়ে গঠিত তা হলো, আল—আযহার মসজিদ, আল-আযহার ইন্সটিটিউট, আল-আযহার বিশ্ববিদ্যালয়, আল-আযহার সুপ্রিম কাউন্সিল, আল-আযহার সিনিয়র স্কলার কাউন্সিল, সংস্কৃতি ও ইসলামী গবেষণা বিভাগ, আল-আযহার গ্রন্থাগার, ইসলামি গবেষণা কেন্দ্র, ফতোয়া কমিটি ও যাকাত ফাণ্ড।</p>
                </div>
            </div>,
        },
        {
            slug: "umrah-and-egypt-package",
            content: <section className="py-10 md:py-20 dark:bg-background.dark text-gray-800 dark:text-gray-300">
                <div className="container mx-auto px-4 sm:px-6 lg:px-8">
                    <h2 className="text-3xl md:text-4xl font-bold text-center text-primary dark:text-text.dark mb-8">
                        ওমরাহ ও মিশর প্যাকেজ - ২,২৫,০০০/-
                    </h2>

                    {/* Package Includes */}
                    <div className="mb-8">
                        <h3 className="text-2xl font-semibold text-primary dark:text-primary-light mb-4">
                            📙 প্যাকেজে যা যা থাকছে :
                        </h3>
                        <ul className="space-y-2">
                            <li>✈ এয়ার টিকিট ( সরাসরি ফ্লাইট )</li>
                            <li>📄 ভিসা</li>
                            <li>🚌 সম্পূর্ণ ট্রান্সপোর্ট সেবা ( মিশরে ৫ দিনের জন্য রিজার্ভ বাস থাকবে )</li>
                            <li>🍽 মক্কা ও মদিনায় দেশীয় খাবার</li>
                            <li>🍽 মিশরে ৩ বেলা দেশীয় খাবার এবং নাস্তা</li>
                            <li>🏨 মিশরে ৪ তারকা হোটেল ( ৩/৪ জন এক রুমে)</li>
                            <li>🏨 মক্কা ও মদিনায় স্ট্যান্ডার্ড মানের হোটেল ( প্রতি রুমে ৪/৫জন )</li>
                            <li>🕋 মক্কায় ঐতিহাসিক স্থানসমূহ পরিদর্শন - জিয়ারা</li>
                            <li>🌄 মদিনায় ঐতিহাসিক স্থানসমূহ পরিদর্শন - জিয়ারা</li>
                            <li>🕌 মক্কা মদিনায় অভিজ্ঞ মুয়াল্লিম</li>
                            <li>🛂 মিশরে গাইড সার্ভিস</li>
                            <li>🌇 মিশর ভ্রমণ</li>
                            <li>💶 সকল স্থানে প্রবেশের ফি ( আলেকজান্দ্রিয়া লাইব্রেরী ছাড়া)</li>
                        </ul>
                    </div>

                    {/* Hotel Information */}
                    <div className="mb-8">
                        <h3 className="text-2xl font-semibold text-primary dark:text-primary-light mb-4">
                            ⏩ উমরা ও মিশর প্যাকেজে হোটেলের তথ্যঃ
                        </h3>
                        <ul className="space-y-2">
                            <li>🕋 মক্কা হোটেলঃ (৪০০- ৬০০ মিটার)</li>
                            <li>🕌 মদিনা হোটেলঃ (২০০-৪০০ মিটার দূরত্বে)</li>
                            <li>🏰 মিশর হোটেল : ৪ তারকা হোটেল। গিজা এরিয়াতে।</li>
                        </ul>
                    </div>

                    {/* Makkah Ziara Spots */}
                    <div className="mb-8">
                        <h3 className="text-2xl font-semibold text-primary dark:text-primary-light mb-4">
                            ✅ মক্কা জিয়ারার স্পটসমূহ :
                        </h3>
                        <ul className="space-y-2">
                            <li>🚌 নবীজির বাড়ী</li>
                            <li>🚌 জাবালে সাওর</li>
                            <li>🚌 হেরা গুহা</li>
                            <li>🚌 আরাফার ময়দান</li>
                            <li>🚌 মিনা</li>
                            <li>🚌 মুজদালিফা</li>
                            <li>🚌 জান্নাতুল মোআল্লা</li>
                            <li>🚌 জিন মসজিদ</li>
                        </ul>
                    </div>

                    {/* Madinah Ziara Spots */}
                    <div className="mb-8">
                        <h3 className="text-2xl font-semibold text-primary dark:text-primary-light mb-4">
                            ✅ মদিনা মনোয়ারা জিয়ারার স্পটসমূহ :
                        </h3>
                        <ul className="space-y-2">
                            <li>🚌 জান্নাতুল বাকী</li>
                            <li>🚌 খন্দকের ময়দান</li>
                            <li>🚌 উহুদ পাহাড়</li>
                            <li>🚌 মাকবারায়ে শোহাদায়ে উহুদ</li>
                            <li>🚌 মসজিদে কিবলাতাইন</li>
                            <li>🚌 মসজিদে কুবা</li>
                            <li>🚌 মসজিদে বেলাল রাযি</li>
                            <li>🚌 মসজিদে আবু বকর রাযি</li>
                            <li>🚌 মসজিদে গমামাহ</li>
                        </ul>
                    </div>

                    {/* Egypt Travel Details */}
                    <div className="mb-8">
                        <h3 className="text-2xl font-semibold text-primary dark:text-primary-light mb-4">
                            🌁 মিশর ভ্রমণ বিস্তারিত :
                        </h3>
                        <ul className="space-y-2">
                            <li>✈ ১ম দিন: ঢাকা থেকে কায়রো (রাতে কায়রো পৌছাবে) ইনশাআল্লাহ।</li>
                            <li>🏞 ২য় দিন: সকালে নাস্তা শেষ করে পুরো দিন পিরামিড, ইজিপ্টিয়ান মিউজিয়াম, সাক্কারা পরিদর্শন এবং নিল নদ ভ্রমণ।</li>
                            <li>🏰 ৩য় দিন: আলেকজান্দ্রিয়ায় ভ্রমণ - নবী দানিয়েল (আঃ), আলেকজান্দ্রিয়া বাতিঘর ও কেল্লা কাইতবাই পরিদর্শন, আলেকজান্দ্রিয়া লাইব্রেরী পরিদর্শন বাহির থেকে।</li>
                            <li>🕌 ৪র্থ দিন: সালাহ উদ্দিন আয়ুবীর কেল্লা, মুহাম্মদ আলী মসজিদ, আমর ইবনে আস মসজিদ এবং আল আজহার পার্ক পরিদর্শন।</li>
                            <li>🏛 ৫ম দিন: তুর পাহাড় এবং সাহারা মরুভুমি ভ্রমণ।</li>
                            <li>✈ ৬ষ্ঠ দিন: উমরা/দেশের উদ্দেশ্যে রওনা করবো। ইনশাআল্লাহ।</li>
                        </ul>
                    </div>

                    {/* Package Exclusions */}
                    <div>
                        <h3 className="text-2xl font-semibold text-primary dark:text-primary-light mb-4">
                            ❌ প্যাকেজ অন্তর্ভুক্ত নয় :
                        </h3>
                        <ul className="space-y-2">
                            <li>☑ তায়েফ, বদর ও ওয়াদি জ্বীন জিয়ারাত অন্তর্ভুক্ত নয়।</li>
                            <li>☑ ব্যক্তিগত খরচ।</li>
                        </ul>
                    </div>
                </div>
            </section>,
        },
        {
            slug: "umrah-package",
            content: <section className="py-10 md:py-20 dark:bg-background.dark text-gray-800 dark:text-gray-300">
                <div className="container mx-auto px-4 sm:px-6 lg:px-8">
                    <h2 className="text-3xl md:text-4xl font-bold text-center text-primary dark:text-text.dark mb-8">
                        ওমরাহ প্রিমিয়াম প্যাকেজ - ১,৩০,০০০/-
                    </h2>

                    {/* Package Includes */}
                    <div className="mb-8">
                        <h3 className="text-2xl font-semibold text-primary dark:text-primary-light mb-4">
                            📙 প্যাকেজে যা যা থাকছে :
                        </h3>
                        <ul className="space-y-2">
                            <li>✈ রিটার্ন এয়ার টিকিট</li>
                            <li>📄 ভিসা</li>
                            <li>🚌 সম্পূর্ণ ট্রান্সপোর্ট সেবা</li>
                            <li>🍽 মক্কা ও মদিনায় দেশীয় খাবার</li>
                            <li>🏨 মক্কা ও মদিনায় স্ট্যান্ডার্ড মানের হোটেল ( প্রতি রুমে ৪/৫জন )</li>
                            <li>🕋 মক্কায় ঐতিহাসিক স্থানসমূহ পরিদর্শন - জিয়ারা★</li>
                            <li>🌄 মদিনায় ঐতিহাসিক স্থানসমূহ পরিদর্শন - জিয়ারা★</li>
                            <li>🕌 মক্কা মদিনায় অভিজ্ঞ মুয়াল্লিম</li>
                            <li>💶 সকল স্থানে প্রবেশের ফি</li>
                            <li>🕋 মক্কা হোটেলঃ (৪০০- ৬০০ মিটার)</li>
                            <li>🕌 মদিনা হোটেলঃ (২০০-৪০০ মিটার দূরত্বে)</li>
                        </ul>
                    </div>

                    {/* Makkah Ziara Spots */}
                    <div className="mb-8">
                        <h3 className="text-2xl font-semibold text-primary dark:text-primary-light mb-4">
                            ✅ মক্কা জিয়ারার স্পটসমূহ :
                        </h3>
                        <ul className="space-y-2">
                            <li>🚌 নবীজির বাড়ী</li>
                            <li>🚌 জাবালে সাওর</li>
                            <li>🚌 হেরা গুহা</li>
                            <li>🚌 আরাফার ময়দান</li>
                            <li>🚌 মিনা</li>
                            <li>🚌 মুজদালিফা</li>
                            <li>🚌 জান্নাতুল মোআল্লা</li>
                            <li>🚌 জিন মসজিদ</li>
                        </ul>
                    </div>

                    {/* Madinah Ziara Spots */}
                    <div className="mb-8">
                        <h3 className="text-2xl font-semibold text-primary dark:text-primary-light mb-4">
                            ✅ মদিনা মনোয়ারা জিয়ারার স্পটসমূহ :
                        </h3>
                        <ul className="space-y-2">
                            <li>🚌 জান্নাতুল বাকী</li>
                            <li>🚌 খন্দকের ময়দান</li>
                            <li>🚌 উহুদ পাহাড়</li>
                            <li>🚌 মাকবারায়ে শোহাদায়ে উহুদ</li>
                            <li>🚌 মসজিদে কিবলাতাইন</li>
                            <li>🚌 মসজিদে কুবা</li>
                            <li>🚌 মসজিদে বেলাল রাযি</li>
                            <li>🚌 মসজিদে আবু বকর রাযি</li>
                            <li>🚌 মসজিদে গমামাহ</li>
                        </ul>
                    </div>

                    {/* Package Exclusions */}
                    <div>
                        <h3 className="text-2xl font-semibold text-primary dark:text-primary-light mb-4">
                            ❌ প্যাকেজ অন্তর্ভুক্ত নয় :
                        </h3>
                        <ul className="space-y-2">
                            <li>☑ তায়েফ, বদর ও ওয়াদি জ্বীন জিয়ারাত অন্তর্ভুক্ত নয়।</li>
                            <li>☑ ব্যক্তিগত খরচ।</li>
                        </ul>
                    </div>
                </div>
            </section>,
        },

    ]

    const TOURPACKAGE = tourPackages.find((it) => it.slug === slug);
    console.log(slug)
    if (!TOURPACKAGE) {
        return <p>PACKAGE post not found</p>; // Handle 404 or missing content here
    }
    return (
        <div className="bg-gradient-secondary">
            <div className="container mx-auto py-[64px] lg:px-8">
                {TOURPACKAGE.content}
            </div>
        </div>
    );
};
