const AlAzharUniversity = () => {
    return (
        <div className="bg-gradient-secondary">
            <div className="container mx-auto py-[100px] lg:px-8">
                <div className="py-10 md:py-20  text-gray-800">
                    <div className="container mx-auto px-4 sm:px-6 lg:px-8">
                        <h2 className="text-3xl md:text-4xl font-bold text-center text-primary  mb-8">
                            আল আযহার বিশ্ববিদ্যালয়
                        </h2>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">প্যাকেজ</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                আল আযহার বিশ্ববিদ্যালয়ের ভর্তি প্যাকেজসমূহ
                                <br />
                                এক লক্ষ ষাট হাজার টাকা (<b>1,60,000/-</b>)(এই প্যাকেজটিতে ওমরাহ ফ্রী)
                                <br />
                                এক লক্ষ ত্রিশ হাজার টাকা (<b>1,30,000/-</b>)
                                <br />
                                <br />
                                <p className="font-bold mb-2">প্যাকেজটির মধ্যে যা অর্তর্ভূক্ত:</p>
                                <ul className=" list-disc ps-6">
                                    <li>টিকেট</li>
                                    <li>ভিসা</li>
                                    <li>অফার লেটার</li>
                                    <li>ভর্তি হওয়া পর‌যন্ত সকল সহযোগিতা</li>
                                </ul>
                                <br />
                                <p className="font-bold mb-2">প্যাকেজটির মধ্যে যা অর্তর্ভূক্ত নয়:</p>
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]">বাসা ভাড়া ও খাবারের খরচ <br /> <b className="mt-2 inline-block leading-5 text-base">(এডভান্স সহ 15 থেকে ২০ হাজার টাকা ১ম মাসের জন্য। পরবর্তী মাস থেকে বাসা ভাড়া, খাবার ও যাতায়াতের জন্য ৮-১০ হাজার টাকা খরচ হবে প্রতি মাসে )</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">ইকামাহর খরচ<br />  <b className="mt-2 inline-block leading-5 text-base">(২৩০ ডলার বা ৩০ হাজার টাকার মতো)</b> </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">মেডিকেল ও যাতায়াতের খরচ<br /> <b className="mt-2 inline-block leading-5 text-base">(৭-৮ হাজার টাকার মতো)</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">কায়রো এয়ারপোর্ট এ স্টীকার লাগানোর খরচ<br /> <b className="mt-2 inline-block leading-5 text-base">(২৫ ডলার বা ৩ হাজার টাকার মতো)</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">উপরের যাবতীয় খরচ মোটামুটি ৪০ থেকে ৫০ হাজার টাকার মতো, যা নিজ খরচে বহন করতে হবে</li>
                                </ul>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">ভর্তির কাগজপত্র</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                <p className="font-bold leading-[24px] mb-5">আল আযহার বিশ্ববিদ্যালয়ে ভর্তি হওয়ার জন্য নিম্নোক্ত কাগজপত্র প্রয়োজনীয়:</p>
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]">পাসপোর্ট <br /> <b className="mt-2 inline-block leading-5 text-base">(যেকোন কম্পিউটার এর দোকান থেকে অথবা অনলাইন থেকে পাসপোর্ট এর জন্য আবেদন করতে পারবেন অথবা ইউটিউব দেখেও পাসপোর্ট এর জন্য আবেদন করতে পারবেন)</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">পুলিশ ক্লিয়ারেন্স<br />  <b className="mt-2 inline-block leading-5 text-base">(যেকোন কম্পিউটার এর দোকান থেকে অথবা অনলাইন থেকে পুলিশ ক্লিয়ারেন্স এর জন্য আবেদন করতে পারবেন অথবা ইউটিউব দেখেও পুলিশ ক্লিয়ারেন্স এর জন্য আবেদন করতে পারবেন)</b> </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">জন্ম নিবন্ধন সার্টিফিকেট<br /> <b className="mt-2 inline-block leading-5 text-base">(জন্ম নিবন্ধন এর অনলাইন কপিটিও আপনি অনলাইন থেকে দেখে নিতে পারবেন অথবা যেকোন কম্পিউটার এর দোকান থেকে প্রিন্ট করতে পারবেন)</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">শরহে বেকায়া বা আলিমের সার্টিফিকেট<br /> <b className="mt-2 inline-block leading-5 text-base">(শরহে বেকায়া বা আলিমের সার্টিফিকেট এবং শরহে বেকায়া বা আলিমের মার্কশীট নোটারী মিনিস্ট্রি করতে হবো। নোটারী মিনিস্ট্রির ঠিকানা আমাদের কাছ থেকে নিতে পারবেন।)</b>
                                        <p className="pt-3 leading-[24px] text-center mb-2 underline">বিশেষ দ্রষ্টব্য:</p>
                                        <ul className="list-disc ps-6 pt-3 inline-block">
                                            <li>শরহে বেকায়ার সার্টিফিকেট এর ক্ষেত্রে সকল বিষয়ে কমপক্ষে পাশ মার্ক্স থাকতে হবে যেমন মকবুল।</li>
                                            <li>আলিমের সার্টিফিকেট এর ক্ষেত্রে সকল বিষয়ে পাশ মার্কস থাকতে হবে যেমন ৩৩ নাম্বার পেতে হবে।</li>
                                            <li><b>আল আযহার বিশ্ববিদ্যালয়ে যে কেউ ভর্তি হতে পারবে যদি কারোর উপরের কাগজপত্রাদি থাকে। আল আযহার বিশ্ববিদ্যালয় সবার জন্য উন্মুক্ত!</b></li>
                                        </ul>
                                    </li>
                                </ul>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">
                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">আল আযহার যাদের জন্য নয়</h3>
                            </div>
                            <p className="text-lg text-justify">
                                <p className="font-bold leading-[24px] mb-5">আল আযহার বিশ্ববিদ্যালয়ে যারা পড়তে ইচ্ছুক তাদেরকে নিম্নোক্ত বিষয় কঠোরভাবে মাথায় রাখতে হবে:</p>
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        আপনি আল আজহারে পড়তে ইচ্ছুক হলে সর্বনিম্ন ৭/৮ বছর পড়াশোনার জন্য আসতে হবে। ইচ্ছে করলে ২০-৩০ বছর পর্যন্ত পড়ারও সুযোগ আছে। তবে মোটামুটি ১০ বছরের মতো পড়াশোনা করতে পারলে হয়তো ভালো একটি যায়গায় যেতে পারবেন। সাত বছরের নিচে যদি আপনি আল আজহারে আসেন। তাহলে আমরা বলব আপনার জীবনকে আপনি নষ্টের দিকে ঠেলে দিয়েছেন,শুধু নষ্ট না এর থেকেও বড় পরিতাপের দিকে ঠেলে দিলেন।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        অবশ্যই এমন মানসিক প্রস্তুতি নিয়ে আসতে হবে যে আপনি মিশরে থাকাকালীন, অর্থনৈতিকভাবে পরিবারের কোনই হাল ধরতে পারবেন না। বিপরীতে এটাও সর্বোচ্চ জানতে হবে যে খরচের জন্য প্রতিমাসে 10 হাজার করে প্রায় দুই-চার বছর পর্যন্ত বাসা থেকে আনতে হবে!
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        যদি মোটামুটি পড়ার জন্য কিতাব ক্রয় করেন ও বিভিন্ন শায়েখদের কাছে গিয়ে দরস করতে চান, নোট বানান,ইলমের জন্য সফর করেন তাহলে নিশ্চয় 10 হাজারের বেশি লাগবে কম না।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        তারপর মিনহা (স্কলারশিপ) যদি ভাগ্যে থাকে তাহলে ভিন্ন কথা। সেটার জন্য ও আছে অফিসে অফিসে কাগজের লড়াই...
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        মিশরে পড়াশোনার পাশাপাশি কাজের কোন সুযোগ নেই। এটা ১০০% সত্যকথা। হাজার হাজার মিশরীয় যুবকরা বেকার। তরুণীরা মসজিদের বারান্দায়, রাস্তায় বসে আছেন একটি মাত্র পাউন্ডের জন্য। তাহলে ভাবুন আপনাকে কাজ কে প্রদান করবে...? ইউরোপের সাথে এখানকার পড়াশোনার জীবন মোটামুটি অনেকটা আলাদা। অনেক ছাত্র ভাইকে বোঝানো হলে তারা বুঝতে চায় না। তারা ভাবেন আমরা তাদেরকে বাঁধা প্রধান করছি....!
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        আবেগে এসে অনেক ছাত্রভাই পাঁচ-ছয়মাস পরে অর্থনৈতিকভাবে ভেঙে পড়েছে। তাদের পরিবার টাকা দেয়ার বিষয়ে আগের মতো রেসপন্স করছে না। পরিবার বলছে কিছু করো কিন্তু নীলনদে ঝাপ দেয়া ছাড়া মিশরে কিছুই করার তেমন কিছুই নেই। যাপিত জীবনের চাহিদা বৈবাহিক হায়াতের ফিকির না হয় বাদই দেওয়া হলো। বয়স বেড়ে চলবে। জীবনের চাহিদা,পড়ার টেবিলের চাপ। পরিবার এর চাহনি। আপনাকে কোন পথে নিয়ে যাবে আপনি নিজেই বুঝে ওঠে পারবেন না। তখন হায়-হায় করা ছাড়া কিছুই থাকে না।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        হ্যাঁ স্রোতের বিপরীতে গিয়ে খোদ অনেক কিছুই করা যায়। কিন্তু সেটাও বা আপনা-আপনি কতজনই বা করতে পারে! সেখানেও আছে দক্ষতার অর্জন ও পরিশ্রম। তাই ইলমের শহরে ইলমের জন্য সফর করা উচিত অর্থের জন্য না।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        অবশ্যই দাওরা ফারেগের পরে আসতে হবে। আমি মনে করি এটা বাধ্যতামূলক। সে ক্ষেত্রে উচ্চমাধ্যমিক-উচ্চস্তরের পড়াশোনার প্রচুর মন-মানসিকতা থাকতে হবে যেকোনো পরিস্থিতিতে। শরীয়ত,ইসলাম,বিশ্ব রাজনীতি,
                                        ভূগোল,আরবি-ইংলিশ ভাষার দক্ষতা অবশ্যই আপনার অর্জন করতে হবে! তা-না হলে ইলমের শহরে আপনি একজন মুসাফির মাত্র ! না পারবেন দু-কথা বলতে আর না পারবেন দু-কথা জানতে ...! আর বিশ্বব্যাপী ইসলাম সম্পর্কে মোটামুটি ভালো ধারনা ত থাকতেই হবে...!
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        যা বললাম শতভাগ সত্য। তবে প্রত্যেক কায়দায় ব্যতিক্রমী থাকে।
                                    </li>
                                </ul>
                            </p>
                        </div>

                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">
                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">আমাদের প্রসেসিং</h3>
                            </div>
                            <p className="text-lg text-justify">
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]">প্রথম ধাপ: <br /> <b className="mt-2 inline-block leading-5 text-base">(আপনার কাছে উপরের যাবতীয় ডকুমেন্টস প্রস্তুত থাকে, তাহলে প্রথমে আপনাকে ৫০,০০০ টাকা অগ্রিম দিয়ে আপনার মিশরের টিকেট রিজার্ভ করতে হবে)</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">দ্বিতীয় ধাপ:<br />  <b className="mt-2 inline-block leading-5 text-base">(টিকেট রিজার্ভ হওয়ার পর আপনাকে ৪০,০০০ টাকা প্রদান করতে হবে। এই ধাপে আপনার মিশরের ভিসা এপ্রুভাল নিশ্চিত করা হবে)</b> </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">তৃতীয় ধাপ:<br /> <b className="mt-2 inline-block leading-5 text-base">(বাকি টাকা পরিশোধ করার পর, আপনাকে ওকে টু বোর্ড প্রদান করা হবে)</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">চতুর্থ ধাপ:<br /> <b className="mt-2 inline-block leading-5 text-base">(আপনার নির্দিষ্ট তারিখে ফ্লাইটে মিশরে পৌঁছানোর পর, আমাদের প্রতিনিধি আপনাকে সাদরে গ্রহণ করবে এবং ভর্তি সংক্রান্ত যাবতীয় কার্যক্রম হাতে কলমে সম্পন্ন করে দিবেন।)</b>
                                    </li>
                                </ul>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">
                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">ভর্তি বিস্তারিত</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}
                            <p className="text-lg text-justify mb-5">
                                আমাদের প্রতিনিধির মাধ্যমে আপনাকে প্রথমেই ভাষা কোর্সে ভর্তি হতে হবে। এ ক্ষেত্রে আপনার কাছে দুটি অপশন রয়েছে:</p>

                            <p className="text-lg text-justify">
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]"> আল আযহারের গণ শিক্ষাক্রম: <br /> <b className="mt-2 inline-block leading-5 text-base">
                                        এখানে আপনি ফ্রিতে ভাষা কোর্সটি করতে পারবেন।
                                        <br />
                                        <br />
                                        কোর্সটি মোট ৬ সেমিস্টার (৬ মুসতাওয়া) পর্যন্ত চলবে; প্রতি সেমিস্টারের সময়কাল ২ মাস।
                                        <br />
                                        <br />
                                        আপনার আরবি ভাষার যোগ্যতার উপর নির্ভর করে যেকোন একটি সেমিস্টারে ভর্তি দিবে (যোগ্যতা অনুযায়ী কখনো ৪ সেমিস্টার অথবা ৫সেমিস্টার আবার কখনো 1 সেমিস্টার ও আপনাকে ভর্তি হতে পারে)।
                                        <br />
                                        <br />
                                        ভাষা কোর্সের আগে আপনাকে একটি ইন্টারভিউ নিবে সেখানে নাহু, সরফ ইত্যাদি বিষয়ে প্রশ্ন করা হবে সেটার সাপেক্ষেই আপনাকে সেমিস্টার এ ভর্তি হতে হবে।
                                        <br />
                                        <br />
                                        কোর্সটি বাধ্যতামূলক, অর্থাৎ, ইয়ার গ্যাপ হোক বা না হোক—অবশ্যই শেষ করতে হবে।</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]"> শেখ যায়েদ (প্রাইভেট শাখা):<br />  <b className="mt-2 inline-block leading-5 text-base">বিকল্প হিসেবে, আপনি শেখ যায়েদ শাখাতেও ভর্তি হতে পারেন।
                                        এই শাখায় সেমিস্টারের ধরন প্রাইভেট।</b> </li>
                                    <li className="mb-5 space-y-1 leading-[24px]"> শরহে বেকায়ার সার্টিফিকেট এর জন্য প্রযোজ্য: <br /> <b className="mt-2 inline-block leading-5 text-base">
                                        ভাষা কোর্স চলাকালীন অবস্থায় আপনাকে কুল্যিয়ার (অনার্সের) সার্কুলার দেওয়া হলে তখন কুল্যিয়ার (অনার্সের) জন্য ভর্তি পরীক্ষা দিতে হবে। ভর্তি পরীক্ষায় উত্তীর্ণ হলে ভাষা কোর্স শেষ হলেই আপনি কুল্যিয়াতে ভর্তি হতে পারবেন। উত্তীর্ণ না হলে সেক্ষেত্রে আপনাকে মাহাদ বা ইন্টারমিডিয়েট এ ভর্তি হতে হবে এবং মাহাদ ৩ বছর ধরে পড়তে হবে এবং তখন মাহাদ শেষ করে আপনি সহজেই তখন আর পরীক্ষা দিতে হবেনা আপনি সরাসরি কুল্যিয়াতে ভর্তি হতে পারবেন।
                                    </b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]"> আলিম পাশ সার্টিফিকেট এর জন্য প্রযোজ্য: <br /> <b className="mt-2 inline-block leading-5 text-base">

                                        ভাষা কোর্স চলাকালীন অবস্থায় আপনাকে কুল্যিয়ার (অনার্সের) সার্কুলার দেওয়া হলে তখন কুল্যিয়ার (অনার্সের) জন্য ভর্তি হতে হবে এর জন্য কোন ভর্তি পরীক্ষার প্রয়োজন হবে না।
                                    </b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">কুল্যিয়ায় প্রথম দুই বছর সকল ফন (বিষয়) পড়তে হবে। যেমন: হাদীস, তাফসীর, ফিকহ ইত্যাদি। তৃতীয় বছর থেকে আপনি আপনার পছন্দ বিষয় নিয়ে পড়াশোনা করতে পারবেন তবে সেই বিষয়ের উপর বিগত পরীক্ষা মুমতায হতে হবে তাহলেই আল আযহার আপনাকে সেই বিষয় পড়ার সুযোগ দিবে।</li>
                                </ul>
                            </p>
                            <p className="pt-3 leading-[24px] text-center mb-2 underline font-bold">বিশেষ দ্রষ্টব্য:</p>
                            <ul className="list-disc ps-6 pt-3 inline-block">
                                <li className="mb-5 space-y-1 leading-[24px]">
                                    ভাষা কোর্স শেষ করতে যদি কুল্যিয়ায় (অনার্সে) ভর্তি হতে যদি গ্যাপ হয়ে যায় তবুও ভাষা কোর্স শেষ করতে হবে এবং পরের বছর কুল্লিয়াতে (অনার্সে) ভর্তি হতে হবে, ভাষা কোর্স বাধ্যতামূলক শেষ করিত হইবে।
                                </li>
                                <li className="mb-5 space-y-1 leading-[24px]">
                                    আলিমের সার্টিফিকেট এর পাশের সন এবং বর্তমান শিক্ষাবর্ষের সন এর মধ্যেকার গ্যাপ ০৩ বছরের বেশি হলে ভাষা কোর্স চলাকালীন অবস্থায় কুল্যিয়ার (অনার্সের) সার্কুলার দেওয়া হলে তখন কুল্যিয়ার (অনার্সের) জন্য ভর্তি পরীক্ষা দিতে হবে। ভর্তি পরীক্ষায় উত্তীর্ণ হলে ভাষা কোর্স শেষ হলেই কুল্যিয়াতে (অনার্সে) ভর্তি হতে পারবে। উত্তীর্ণ না হলে সেক্ষেত্রে মাহাদ বা ইন্টারমিডিয়েট এ ভর্তি হতে হবে এবং মাহাদ ৩ বছর ধরে পড়তে হবে এবং মাহাদ শেষ করে সহজেই তখন আর পরীক্ষা দিতে হবেনা সরাসরি কুল্যিয়াতে (অনার্সে) ভর্তি হতে পারবে।
                                </li>
                                <li className="mb-5 space-y-1 leading-[24px]">
                                    আমাদের ইসলামিক বিষয় ছাড়া অন্য কোন বিষয়ের উপর কোন কার্যক্রম নেই। তাছাড়া আপনি যদি জেনেরাল বিষয়ে আল আযহার বিশ্ববিদ্যালয়ে পড়াশোনা করতে চান সেক্ষেত্রে প্রতি বছর ৬০০০ ডলার খরচ করতে হবে। সাধারণত আমরা জেনারেল থেকে আল আযহার বিশ্ববিদ্যালয়ে পড়ার জন্য নিরুৎসাহিত করে থাকি।
                                </li>
                                <li className="mb-5 space-y-1 leading-[24px]">
                                    মেয়েদের ক্ষেত্রে অবশ্যই একজন মাহরাম থাকতে হবে যে আল আযহারে ভর্তি থেকে শুরু করে হোস্টেল এ উঠিয়ে দিয়ে আসা পর‌্যন্ত থাকতে হবে। এবং হোস্টেল এ ইন্দোনেশিয়ান মেয়েদের সাথে বসবাস করতে হবে। সাধারণত আল আযহারে মেয়ারা তাদের হাজবেন্ডদের সাথেই থাকে।
                                </li>
                                <li className="mb-5 space-y-1 leading-[24px]">
                                    আল আযহার বিশ্ববিদ্যালয়ে কেউ অনার্স না করলে সে আল আযহার বিশ্ববিদ্যালয়ে মাস্টার্স করতে পারবেনা।
                                </li>
                                <li className="mb-5 space-y-1 leading-[24px]">
                                    ২৩০ ডলার নিয়ে যেই ইকামাহ নেওয়া হয় তার মেয়াদ ৬-৮ মাস পরবর্তীতে আল আযহার বিশ্ববিদ্যালয়ে ভর্তি হওয়ার পর আল আযহার বিশ্ববিদ্যালয় থেকেই রেসিডেন্সিয়াল কার্ড দিয়ে দেওয়া হয়।
                                </li>
                                <li className="mb-5 space-y-1 leading-[24px]">
                                    18 বছরের নিচে হলে অবশ্যই একজন গার্জিয়ান থাকতে হবে যে আল আযহারে ভর্তি থেকে শুরু করে হোস্টেল এ উঠিয়ে দিয়ে আসা পর‌্যন্ত থাকতে হবে।
                                </li>
                            </ul>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">স্কলারশিপ ও খরচ</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]"> শিক্ষা ফি ও বেতন: <br /> <b className="mt-2 inline-block leading-5 text-base">(আল আযহার বিশ্ববিদ্যালয়ে ইসলামিক বিষয় যেমন কোরআন শিক্ষা (মুখস্থকরণ ও তাজ্বিদ), তাফসীর, হাদিস, ফিকাহ (ইসলামিক আইন), আকীদাহ (ইসলামিক বিশ্বাস), ইসলামিক ইতিহাস, আরবি ভাষা ও সাহিত্য, সুফিজম (ইসলামী আধ্যাত্মিকতা) ইত্যাদি পড়ার জন্য কোনো টিউশন ফি বা বেতন দিতে হয় না।
                                        <br />
                                        <br />
                                        শুধুমাত্র আপনার 🍽️ খাওয়া-দাওয়ার ব্যয় নিজে বহন করতে হবে।)</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">স্কলারশিপ:<br />  <b className="mt-2 inline-block leading-5 text-base">(স্কলারশিপ পাওয়া সম্পূর্ণভাবে 🍀 ভাগ্য ও 🧠 মেধার বিষয়।<br />
                                        ধারাবাহিকভাবে ২-৩ বছর কঠোর পরিশ্রম ও ট্রাই করতে হবে।<br /><br />
                                        শুধুমাত্র মেধাবী ও ভালো ফলাফলের অধিকারী ছাত্রদেরই স্কলারশিপ দেওয়া হয়।)</b> </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">কাজ করার সুযোগ:<br /> <b className="mt-2 inline-block leading-5 text-base">(পড়ালেখার পাশাপাশি কাজ করার কোনো সুযোগ নেই বা খুবই সীমিত।
                                        অনেকেই টুকিটাকি কাজ করে থাকলেও, কাজ করলে আপনার পড়ালেখার উপর প্রভাব পড়তে পারে, যা ভবিষ্যতে আপনার কাঙ্ক্ষিত লক্ষ থেকে সরে যেতে পারে।)</b></li>

                                </ul>
                            </p>
                        </div>

                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">
                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">প্রাতিষ্ঠানিক শিক্ষা ব্যবস্থা</h3>
                            </div>
                            <p className="text-lg text-justify">
                                <p className="font-bold leading-[24px] mb-5">আধুনিক আল-আযহারের প্রাতিষ্ঠানিক শিক্ষা ব্যবস্থা মূলত ৭ টি বিশেষ স্তরে বিন্যস্ত। নিম্নের স্তরসমূহের নাম ও সময়কাল তুলে ধরা হলো:</p>
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        ইবতিদায়ি বা প্রাথমিক (৬ বছর)।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        ইদাদি বা মাধ্যমিক (৩ বছর)।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        সানুবিয়্যাহ বা উচ্চ মাধ্যমিক (৩ বছর)।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        কুল্লিয়া বা অনার্স (৪ বছর)।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        দিরাসাত উলইয়া বা মাস্টার্স (২ বছর)।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        এমফিল (৩ থেকে ৫+ বছর)।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        পিএইচডি বা ডক্টরেট (৩ থেকে ৫+ বছর)
                                    </li>
                                </ul>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">
                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">মা’হাদুল ক্বেরাত</h3>
                            </div>
                            <p className="text-lg text-justify">
                                <p className="font-bold leading-[24px] mb-5">ক্বেরাত বিভাগ নিম্নোক্ত শ্রেণীতে বিন্যস্ত:</p>
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        তাজবীদ বিভাগ (দুই বছর)

                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        উচ্চতর বিভাগ (তিন বছর)

                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        তাখাসসুস বিভাগ (তিন বছর)
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        তাজবীদ বিভাগে ভর্তি হতে চাইলে একজন ছাত্রকে অবশ্যই হাফেযে কোরআন হতে হবে। আরবী ভাষা ও ক্বোরান হিফযের উপর পরীক্ষা হবে।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        যে সকল বিদেশী ছাত্ররা কুল্লিয়াতুল ক্বেরাত থেকে তাখাসসুসের সনদপত্র অর্জন করেছে তারাও আযহারে ভর্তি হতে পারবে।
                                    </li>
                                </ul>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">
                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">আল-আযহার বিশ্ববিদ্যালয়ের অনুষদ</h3>
                            </div>
                            <p className="text-lg text-justify">
                                <p className="font-bold leading-[24px] mb-5">
                                    আধুনিক আল-আযহার বিশ্ববিদ্যালয়ের মৌলিক ২৪ টি অনুষদ রয়েছে । প্রতিটি অনুষদের অধীনেই রয়েছে একাধিক বিভাগ।
                                </p>
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        আকিদা, দর্শন, ধর্মতত্ত, উলুমুল কুরআন, তাফসির, কিরাত, তাজবিদ, হাদিস, উসুলুল হাদিস, রিজাল, ফিকহ, ইসলামি আইন, আরবি ভাষা, বালাগাত, তর্কশাস্ত্র, তাসাওউফ, ইসলামি দাওয়াহ, তারবিয়াহ, ইতিহাস, সভ্যতা, ভূগোল, পৌরনীতি, অর্থনীতি, সমাজবিজ্ঞান, রাষ্ট্রবিজ্ঞান, সংস্কৃতি, বিজ্ঞান, ব্যবসা, গণিত, ইংরেজি ভাষা, ফরাসি ভাষা, বিবিধ ভাষা ও অনুবাদ সাহিত্য, চিকিৎসা নার্সিং, দন্তচিকিৎসা, ফার্মেসী, প্রকৌশল, কৃষি ও সাংবাদিকতাসহ ধর্মীয় ও জাগতিক বিভিন্ন শাস্ত্রের সমন্বয়ে আল-আযহার হয়ে উঠে একটি পূর্ণাঙ্গ বিশ্ববিদ্যালয়।
                                    </li>
                                </ul>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">
                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">বাংলাদেশি শিক্ষার্থীদের পছন্দনীয় অনুষদসমূহ</h3>
                            </div>
                            <p className="text-lg text-justify">
                                <p className="font-bold leading-[24px] mb-5">আল-আযহার বিশ্ববিদ্যালয়ের ৬ টি অনুষদ বিদেশী শিক্ষার্থীদের নিকট অধিক প্রিয়। বাংলাদেশসহ পৃথিবীর বিভিন্ন দেশ থেকে আগত মুসলিম শিক্ষার্থীদের সিংহভাগই এই ৬ টি অনুষদের কোনো একটিতে অধ্যয়ন করে থাকে। অনুষদ ৬ টি হলো:</p>
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        ধর্মতত্ত অনুষদ।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        শরিয়া ও আইন অনুষদ।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        আরবি ভাষা অনুষদ।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        ইসলামি শিক্ষা ও আরবি অনুষদ।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        ইসলামি বিজ্ঞান অনুষদ।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        ইসলামি দাওয়া অনুষদ
                                    </li>
                                </ul>
                            </p>
                        </div>


                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">
                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary">হিফযুল কুরআন</h3>
                            </div>
                            <p className="text-lg text-justify">
                                <p className="leading-[24px] mb-5">আল-আযহারে হিফযুল কুরআনের গুরুত্ব অপরিসীম। প্রতিটি শিক্ষার্থীকে প্রাথমিক থেকে উচ্চ মাধ্যমিক পর্যন্ত ১২ বছরের মধ্যেই সম্পূর্ণ ৩০ পারা আল-কুরআন হিফয করতে হয়। এরপর অনার্সের চার বছরের প্রতি বছর সাড়ে সাত পারা করে আবার সম্পূর্ণ আল-কুরআন রিভিশন দিতে হয়। এমনকি মাস্টার্সের ২ বছরের প্রতি বছর আবারও ৩০ পারা করে রিভিশন দিতে হয়। তবে সরাসরি অনার্সে ভর্তি হওয়া বিদেশী শিক্ষার্থীদের উপর যাতে অতিরিক্ত চাপ না হয় তাই তাদের জন্য প্রতি বছর শুধু 1 পারা করে হিফযুল কুরআনের নেসাব রাখা হয়েছে। মিশরি ও বিদেশী উভয় প্রকারের শিক্ষার্থীদেরই প্রতি বছর লিখিত ও মৌখিক দুই ভাবে হিফযুল কুরআনের আলাদা আলাদা দুটি করে পরীক্ষা দিতে হয়।</p>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">
                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary">আরবি ভাষা</h3>
                            </div>
                            <p className="text-lg text-justify">
                                <p className="leading-[24px] mb-5">একজন আযহারি শিক্ষার্থী যে বিষয় নিয়েই অধ্যয়ন করুক না কেন তাকে অবশ্যই নাহু, সরফ, বালাগাত, আদাব ও নুসুসসহ আরবি ভাষার বিভিন্ন শাখাশাস্ত্র এবং তাফসির, উলুমুল কুরআন, তাজবিদ, কিরাত, হাদিস ও ফিকহসহ অন্যান্য শরিয়াহ শাস্ত্রসমূহও পর্যাপ্ত অধ্যয়ন করতে হয়। প্রকৌশল, চিকিৎসা ও ব্যাবসাসহ অন্যান্য জাগতিক অনুষদের শিক্ষার্থীদের জন্যও এ শিক্ষা বাধ্যতামূলক।</p>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">আরবীতে পারদর্শী</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                বিদেশী ছাত্ররা আরবীতে পারদর্শী হলেই কেবল মাধ্যমিক ও উচ্চ মাধ্যমিক স্তরে ভর্তি হতে পারবে। যদি আরবীতে কথা বলা,লেখা,পড়তে পারা ও শুনেবুঝতে পারার যোগ্যতা না থাকে, তাহলে তাকে বিশেষ কোর্সে ভর্তি হতে হবে।


                                <br />
                                <br />
                                <p className="font-bold mb-2">বিশেষ কোর্স:</p>
                                <ul className=" list-disc ps-6">
                                    <li>এই কোর্সের মাধ্যমে একজন শিক্ষার্থী আরবী ভাষা ও ইসলাম সম্পর্কিত প্রাথমিক জ্ঞাণ লাভ করতে পারবে। কোর্সটি শুরু হয় সেপ্টেম্বর মাসে এবং শেষ হয় জুন মাসে। কেউ ইচ্ছা করলে গ্রীষ্মের সময় অর্থাৎ, জুন থেকে সেপ্টেম্বর পর্যন্ত কোর্সটি চালু রাখতে পারে।এই কোর্সটি নিম্নোল্লেখিত দলকে উদ্দেশ্য করে:<br />

                                        <ul className="list-disc ps-6 pt-3 inline-block">
                                            <li>বিদেশী সেই সকল ছাত্র যারা আরবীতে কথা বলতে পারেনা।</li>
                                            <li>তাহদিদুল মুস্তাওয়া পরীক্ষার মাধ্যমে উদ্দিষ্ট ক্লাসে ভর্তি হওয়ার জন্য যাদের শিক্ষাগত কোন সনদপত্র নেই।
                                            </li>
                                            <li>অথবা যাদের সনদপত্র আছে কিন্তু আরবী এবং ইসলামি কিছু বিষয় তার পড়া হয়নি। এমতাবস্থায় সনদপত্রকে যারা পরিপুর্ন করতে চায় তারা এই কোর্সের মাধ্যমে তা করতে পারবে।
                                            </li>
                                            <li>বিদেশী যে ছাত্ররা সনদপত্রবিহীন৩ ইসলামি বিভিন্ন বিষয় ও আরবী শিখতে চায়।
                                            </li>
                                        </ul>
                                    </li>

                                </ul>
                                <br />

                            </p>
                        </div>

                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">
                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary">চার মাযহাব</h3>
                            </div>
                            <p className="text-lg text-justify">
                                <p className="leading-[24px] mb-5">আবহমান কাল থেকেই আল-আযহার আহলুস সুন্নাহর প্রসিদ্ধ চারও ফিকহী মাযহাবের উপর যথাযথ গুরুত্ব দিয়ে আসছে। হানাফি, মালেকি, হাম্বালি ও শাফেয়ি চারও মাযহাবের পাঠদান যেমন আযহারের মসজিদভিত্তিক শিক্ষা ব্যবস্থায় সূচনালগ্ন থেকেই চলে আসছে তেমনিভাবে আযহার বিশ্ববিদ্যালয়ের পাঠ্যসূচীতেও গুরুত্বের সাথে বিদ্যমান রয়েছে চারও মাযহাবের গ্রন্থাদি। লা-মাযহাবিয়্যাত বা সালাফি মতাদর্শকে আযহার সব সময়ই প্রত্যাখ্যান করে আসছে।
                                    একজন শিক্ষার্থী আল-আযহারে অধ্যয়ন শুরুর পূর্বেই তাকে নিজের মাযহাব স্পষ্ট উল্লেখ করতে হয়। যেহেতু মিশরের মুসলিমগণ ঢালাওভাবে সকলে নিদির্ষ্ট এক মাযহাবের অনুসারী নন বরং তাদের মধ্যে চারও মাযহাবের অনুসারীই বিদ্যমান এবং পৃথিবীর বিভিন্ন দেশ থেকে আগত বিদেশী শিক্ষার্থীরাও অঞ্চলভেদে ভিন্ন ভিন্ন মাযহাবের অনুসারী হয়ে থাকে তাই সাধারণত প্রাক বিশ্ববিদ্যালয় স্তরসমূহে প্রতি মাযহাবের শিক্ষার্থীদের ভিন্ন ভিন্ন শ্রেণীকক্ষে নির্ধারিত মাযহাবের বিশেষজ্ঞ শিক্ষকদের মাধ্যমে ফিকহের পাঠদান করা হয়। অনার্স ও মাস্টার্স পর্যায়েও রয়েছে মাযহাব ভিত্তিক ফিকহের দরস।
                                </p>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">
                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary">আকিদা</h3>
                            </div>
                            <p className="text-lg text-justify">
                                <p className="leading-[24px] mb-5">আকিদার ক্ষেত্রে আল-আযহার ‘আহলুস সুন্নাহ ওয়াল জামাআহ’ এর অন্তর্ভুক্ত। আহলুস সুন্নাহর নিকট আকিদার প্রসিদ্ধ দুই মাযহাব তথা আশআরি ও মাতুরুদি আকিদাই আল-আযহারের আকিদা। আযহারি আলেমগণ আহলুস সুন্নাহর চার মাযহাব তথা হানাফি, মালেকি, হাম্বালি ও শাফেয়ি মাযহাবের কোন একটিরই অনুসরণ করে থাকেন। সেই সাথে উপমহাদেশের প্রসিদ্ধ দ্বীনি বিদ্যাপীঠ ‘দারুল উলূম দেওবন্দের’ মতো আযহারও তাসাউফের বিভিন্ন সহিহ তরিকার প্রতি বিশ্বাসী।

                                </p>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">
                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary">প্রসারতা</h3>
                            </div>
                            <p className="text-lg text-justify">
                                <p className="leading-[24px] mb-5">মাহাদুল আযহার বা আল-আযহার ইনস্টিটিউট নামে সমগ্র মিশর জুড়ে রয়েছে আল-আযহারের প্রাথমিক, মাধ্যমিক ও উচ্চমাধ্যমিক তথা প্রাক বিশ্ববিদ্যালয় স্তরসমূহের অসংখ্য শাখা। এছাড়াও রাজধানী কায়রোসহ বিভিন্ন শহরে রয়েছে বিশ্ববিদ্যালয় স্তরের ২৪ টি মৌলিক অনুষদ ও অনুষদভুক্ত বিভাগসমূহ। ২৪ টি অনুষদ বিভিন্ন শহরে পুনরাবৃত্ত হয়ে মোট অনুষদ সংখ্যা দাঁড়িয়েছে প্রায় ৮৭ টি। তবে কেন্দ্রীয় কার্যক্রম রাজধানী কায়রো থেকেই নিয়ন্ত্রিত হয়। সেই সাথে আযহারের মিশরি ও বিদেশী শিক্ষার্থীদের আবাসন ও প্রশাসনিক কার্যক্রমের জন্য রয়েছে মাশিখাতুল আযহার, মারকাযুত তাতবির লিতালিমিত তুল্লাবিল ওয়াফিদিন ওয়াল আযানিব, মাজমাউল বুহুসিল ইসলামিয়্যা, মদিনাতুল বুয়ুস ও আল-ইসকানুত তুল্লাবিয়্যুসহ বহু বড় বড় কম্প্লেক্স।
                                    এছাড়াও মিশরের বাইরে বহু দেশে রয়েছে অসংখ্য আল-আযহার ইনস্টিটিউট। এসকল প্রতিষ্ঠান আল-আযহারের অধীনে প্রত্যক্ষ বা পরোক্ষভাবে স্থানীয় আযহারিদের মাধ্যমে পরিচালিত হয়ে থাকে।


                                </p>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">
                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary">ফতোয়া বোর্ড</h3>
                            </div>
                            <p className="text-lg text-justify">
                                <p className="leading-[24px] mb-5">আল-আযহারের ‘দারুল ইফতা বা ফতোয়া বোর্ড’ বিশ্ববিদ্যালয়ের শরিয়া ও আইন অনুষদ থেকে সম্পূর্ণ আলাদা। একজন আলিম তখনই আল-আযহার থেকে মুফতি উপাধি পাবেন যখন তিনি ‘দারুল ইফতা’ এর চার বছরের বিশেষ কোর্স সমাপ্ত করবেন।
                                </p>
                            </p>
                        </div>

                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">
                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">প্রসিদ্ধ আলেম</h3>
                            </div>
                            <p className="text-lg text-justify">

                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        আহমাদ আত-তাইয়্যিব: তিনি আল-আযহারের বর্তমান শাইখুল আযহার বা গ্র্যান্ড শাইখ। তাকে ‘আল-ইমামুল আকবর’ উপাধিতে ভূষিত করা হয়।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        মুহাম্মাদ আল-মিহরাসাবি: তিনি আল-আযহারের প্রাক্তন প্রধান। গত ২০২২ খ্রিস্টাব্দের আগস্টে অবসর গ্রহণ করেন।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        ইবরাহিম হুদহুদ: তিনিও আল-আযহারের প্রাক্তন প্রধান। বিভিন্ন শাস্ত্রে তার পান্ডিত্য সর্ব মহলে প্রশংসনীয়।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        প্রফেসর ড. আহমাদ ওমর হাশিম: তিনি আযহারের হাদিস বিভাগের শিক্ষক। তাকে বর্তমান যুগের ‘আমিরুল মুমিনিন ফিল হাদিস’ বলা হয়। তার লক্ষাধিক হাদিস মুখস্থ রয়েছে।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        প্রফেসর ড. আহমাদ মাবাদ আব্দুল কারিম: তিনি শাফেয়ি মাযহাবের অনুসারী। হাদিস বিভাগের ডক্টর। হাদিস শাস্ত্রের এক উজ্জ্বল নক্ষত্র।
                                    </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">
                                        প্রফেসর ড. মাহমুদ আব্দুর রহমান: একজন ফিকহের শিক্ষক হওয়া সত্তে ও তার হাদিসের নয়টি গ্রন্থ মুখস্থ। গ্রন্থগুলো যথাক্রমে- বুখারি, মুসলিম, তিরমিযি, আবু দাউদ, নাসায়ী, ইবনু মাজা, মুয়াত্তা ইমাম মালেক, দারেমি ও মুসনাদ আহমাদ । তিনি মালেকি মাযহাবের অনুসারী।
                                    </li>
                                </ul>
                            </p>
                        </div>


                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">আমাদের ঠিকানা</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                <p className="font-bold leading-[24px] mb-5">স্থায়ী অফিস ঠিকানা:</p>
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]">মেবাইল: <br /> <b className="mt-2 inline-block leading-5 text-base">(013 1818 5954 - হানযালা)</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]"><a href="https://maps.app.goo.gl/XCGEmDw9jyrYoNh36" target="_blank">অফিস ম্যাপ:<br />  <b className="mt-2 inline-block leading-5 text-base">
                                        (https://maps.app.goo.gl/<br />XCGEmDw9jyrYoNh36)</b></a> </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">ঠিকানা:<br /> <b className="mt-2 inline-block leading-5 text-base">(বাসা-২/এ, রোড-৭, নবীনগর হাউজিং, সাদেক এগ্রোর পাশের বিল্ডিং, লোহার গেইট, ঢাকা উদ্যান, গাবতলী রোড, মোহাম্মাদপুর, ঢাকা ১২০৭)</b></li>

                                </ul>
                            </p>
                        </div>
                    </div>
                </div>
            </div>
        </div >
    );
};

export default AlAzharUniversity;