const TermsAndConditions = () => {
    return (
        <div className="bg-gradient-secondary">
            <div className="container mx-auto py-[100px] lg:px-8">
                <div className="py-10 md:py-20  text-gray-800">
                    <div className="container mx-auto px-4 sm:px-6 lg:px-8">
                        <h2 className="text-3xl md:text-4xl font-bold text-center text-primary  mb-8">
                            আল আযহার বিশ্ববিদ্যালয়
                        </h2>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">প্যাকেজ</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                আল আযহার বিশ্ববিদ্যালয়ের ভর্তি প্যাকেজ এক লক্ষ পনেরো হাজার টাকা (1,15,000/-)

                                <br />
                                <br />
                                <p className="font-bold mb-2">প্যাকেজটির মধ্যে যা অর্তর্ভূক্ত:</p>
                                <ul className=" list-disc ps-6">
                                    <li>টিকেট</li>
                                    <li>ভিসা</li>
                                    <li>অফার লেটার</li>
                                    <li>ভর্তি হওয়া পর‌যন্ত সকল সহযোগিতা</li>
                                </ul>
                                <br />
                                <p className="font-bold mb-2">প্যাকেজটির মধ্যে যা অর্তর্ভূক্ত নয়:</p>
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]">বাসা ভাড়া ও খাবারের খরচ <br /> <b className="mt-2 inline-block leading-5 text-base">(এডভান্স সহ ১৫ থেকে ২০ হাজার টাকা ১ম মাসের জন্য। পরবর্তী মাস থেকে বাসা ভাড়া, খাবার ও যাতায়াতের জন্য ৮-১০ হাজার টাকা খরচ হবে প্রতি মাসে )</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">ইকামাহর খরচ<br />  <b className="mt-2 inline-block leading-5 text-base">(২৩০ ডলার বা ৩০ হাজার টাকার মতো)</b> </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">মেডিকেল ও যাতায়াতের খরচ<br /> <b className="mt-2 inline-block leading-5 text-base">(৭-৮ হাজার টাকার মতো)</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">কায়রো এয়ারপোর্ট এ স্টীকার লাগানোর খরচ<br /> <b className="mt-2 inline-block leading-5 text-base">(২৫ ডলার বা ৩ হাজার টাকার মতো)</b></li>
                                </ul>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">ভর্তির কাগজপত্র</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                <p className="font-bold leading-[24px] mb-5">আল আযহার বিশ্ববিদ্যালয়ে ভর্তি হওয়ার জন্য নিম্নোক্ত কাগজপত্র প্রয়োজনীয়:</p>
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]">পাসপোর্ট <br /> <b className="mt-2 inline-block leading-5 text-base">(যেকোন কম্পিউটার এর দোকান থেকে অথবা অনলাইন থেকে পাসপোর্ট এর জন্য আবেদন করতে পারবেন অথবা ইউটিউব দেখেও পাসপোর্ট এর জন্য আবেদন করতে পারবেন)</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">পুলিশ ক্লিয়ারেন্স<br />  <b className="mt-2 inline-block leading-5 text-base">(যেকোন কম্পিউটার এর দোকান থেকে অথবা অনলাইন থেকে পুলিশ ক্লিয়ারেন্স এর জন্য আবেদন করতে পারবেন অথবা ইউটিউব দেখেও পুলিশ ক্লিয়ারেন্স এর জন্য আবেদন করতে পারবেন)</b> </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">জন্ম নিবন্ধন সার্টিফিকেট<br /> <b className="mt-2 inline-block leading-5 text-base">(জন্ম নিবন্ধন এর অনলাইন কপিটিও আপনি অনলাইন থেকে দেখে নিতে পারবেন অথবা যেকোন কম্পিউটার এর দোকান থেকে প্রিন্ট করতে পারবেন)</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">শরহে বেকায়া বা আলিমের সার্টিফিকেট<br /> <b className="mt-2 inline-block leading-5 text-base">(শরহে বেকায়া বা আলিমের সার্টিফিকেট এবং শরহে বেকায়া বা আলিমের মার্কশীট নোটারী মিনিস্ট্রি করতে হবো। নোটারী মিনিস্ট্রির ঠিকানা আমাদের কাছ থেকে নিতে পারবেন।)</b>
                                        <p className="pt-3 leading-[24px] text-center mb-2 underline">বিশেষ দ্রষ্টব্য:</p>
                                        <ul className="list-disc ps-6 pt-3 inline-block">
                                            <li>শরহে বেকায়ার সার্টিফিকেট এর ক্ষেত্রে সকল বিষয়ে কমপক্ষে পাশ মার্ক্স থাকতে হবে যেমন মকবুল।</li>
                                            <li>আলিমের সার্টিফিকেট এর ক্ষেত্রে সকল বিষয়ে পাশ মার্কস থাকতে হবে যেমন ৩৩ নাম্বার পেতে হবে।</li>
                                        </ul>
                                    </li>
                                </ul>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">আমাদের ঠিকানা</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                <p className="font-bold leading-[24px] mb-5">স্থায়ী অফিস ঠিকানা:</p>
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]">মেবাইল: <br /> <b className="mt-2 inline-block leading-5 text-base">(013 1818 5954 - হানযালা)</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]"><a href="https://maps.app.goo.gl/XCGEmDw9jyrYoNh36" target="_blank">অফিস ম্যাপ:<br />  <b className="mt-2 inline-block leading-5 text-base">(https://maps.app.goo.gl/XCGEmDw9jyrYoNh36)</b></a> </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">ঠিকানা:<br /> <b className="mt-2 inline-block leading-5 text-base">(বাসা-২/এ, রোড-৭, নবীনগর হাউজিং, সাদেক এগ্রোর পাশের বিল্ডিং, লোহার গেইট, ঢাকা উদ্যান, গাবতলী রোড, মোহাম্মাদপুর, ঢাকা ১২০৭)</b></li>

                                </ul>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">আমাদের প্রসেসিং</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]">প্রথম ধাপ: <br /> <b className="mt-2 inline-block leading-5 text-base">(আপনার কাছে উপরের যাবতীয় ডকুমেন্টস প্রস্তুত থাকে, তাহলে প্রথমে আপনাকে ৫০,০০০ টাকা অগ্রিম দিয়ে আপনার মিশরের টিকেট রিজার্ভ করতে হবে)</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">দ্বিতীয় ধাপ:<br />  <b className="mt-2 inline-block leading-5 text-base">(টিকেট রিজার্ভ হওয়ার পর আপনাকে ৪০,০০০ টাকা প্রদান করতে হবে। এই ধাপে আপনার মিশরের ভিসা এপ্রুভাল নিশ্চিত করা হবে)</b> </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">তৃতীয় ধাপ:<br /> <b className="mt-2 inline-block leading-5 text-base">(বাকি টাকা পরিশোধ করার পর, আপনাকে ওকে টু বোর্ড প্রদান করা হবে)</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">চতুর্থ ধাপ:<br /> <b className="mt-2 inline-block leading-5 text-base">(আপনার নির্দিষ্ট তারিখে ফ্লাইটে মিশরে পৌঁছানোর পর, আমাদের প্রতিনিধি আপনাকে সাদরে গ্রহণ করবে এবং ভর্তি সংক্রান্ত যাবতীয় কার্যক্রম হাতে কলমে সম্পন্ন করে দিবেন।)</b>
                                    </li>
                                </ul>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">স্কলারশিপ ও খরচ</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]"> শিক্ষা ফি ও বেতন: <br /> <b className="mt-2 inline-block leading-5 text-base">(আল আযহার বিশ্ববিদ্যালয়ে ইসলামিক বিষয় যেমন কোরআন শিক্ষা (মুখস্থকরণ ও তাজ্বিদ), তাফসীর, হাদিস, ফিকাহ (ইসলামিক আইন), আকীদাহ (ইসলামিক বিশ্বাস), ইসলামিক ইতিহাস, আরবি ভাষা ও সাহিত্য, সুফিজম (ইসলামী আধ্যাত্মিকতা) ইত্যাদি পড়ার জন্য কোনো টিউশন ফি বা বেতন দিতে হয় না।
                                        <br />
                                        <br />
                                        শুধুমাত্র আপনার 🍽️ খাওয়া-দাওয়ার ব্যয় নিজে বহন করতে হবে।)</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]">স্কলারশিপ:<br />  <b className="mt-2 inline-block leading-5 text-base">(স্কলারশিপ পাওয়া সম্পূর্ণভাবে 🍀 ভাগ্য ও 🧠 মেধার বিষয়।<br />
                                        ধারাবাহিকভাবে ২-৩ বছর কঠোর পরিশ্রম ও ট্রাই করতে হবে।<br /><br />
                                        শুধুমাত্র মেধাবী ও ভালো ফলাফলের অধিকারী ছাত্রদেরই স্কলারশিপ দেওয়া হয়।)</b> </li>
                                    <li className="mb-5 space-y-1 leading-[24px]">কাজ করার সুযোগ:<br /> <b className="mt-2 inline-block leading-5 text-base">(পড়ালেখার পাশাপাশি কাজ করার কোনো সুযোগ নেই বা খুবই সীমিত।
                                        অনেকেই টুকিটাকি কাজ করে থাকলেও, কাজ করলে আপনার পড়ালেখার উপর প্রভাব পড়তে পারে, যা ভবিষ্যতে আপনার কাঙ্ক্ষিত লক্ষ থেকে সরে যেতে পারে।)</b></li>

                                </ul>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">ভর্তি বিস্তারিত</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}
                            <p className="text-lg text-justify mb-5">
                                ইকামাহ নেওয়ার পর, আপনাকে প্রথমেই ভাষা কোর্সে ভর্তি হতে হবে। এ ক্ষেত্রে আপনার কাছে দুটি অপশন রয়েছে:</p>

                            <p className="text-lg text-justify">
                                <ul className=" list-disc ps-6">
                                    <li className="mb-5 space-y-1 leading-[24px]"> আল আযহারের গণ শিক্ষাক্রম: <br /> <b className="mt-2 inline-block leading-5 text-base">
                                        এখানে আপনি ফ্রিতে ভাষা কোর্সটি করতে পারবেন।
                                        <br />
                                        <br />
                                        কোর্সটি মোট ৬ সেমিস্টার (৬ মুসতাওয়া) পর্যন্ত চলবে; প্রতি সেমিস্টারের সময়কাল ২ মাস।
                                        <br />
                                        <br />
                                        আপনার আরবি ভাষার যোগ্যতার উপর নির্ভর করে যেকোন একটি সেমিস্টারে ভর্তি দিবে (যোগ্যতা অনুযায়ী কখনো ৪ সেমিস্টার অথবা ৫সেমিস্টার আবার কখনো ১ সেমিস্টার ও আপনাকে ভর্তি হতে পারে)।
                                        <br />
                                        <br />
                                        ভাষা কোর্সের আগে আপনাকে একটি ইন্টারভিউ নিবে সেখানে নাহু, সরফ ইত্যাদি বিষয়ে প্রশ্ন করা হবে সেটার সাপেক্ষেই আপনাকে সেমিস্টার এ ভর্তি হতে হবে।
                                        <br />
                                        <br />
                                        কোর্সটি বাধ্যতামূলক, অর্থাৎ, ইয়ার গ্যাপ হোক বা না হোক—অবশ্যই শেষ করতে হবে।</b></li>
                                    <li className="mb-5 space-y-1 leading-[24px]"> শেখ যায়েদ (প্রাইভেট শাখা):<br />  <b className="mt-2 inline-block leading-5 text-base">বিকল্প হিসেবে, আপনি শেখ যায়েদ শাখাতেও ভর্তি হতে পারেন।
                                        এই শাখায় সেমিস্টারের ধরন প্রাইভেট।</b> </li>


                                </ul>
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary   ">শরহে বেকায়া</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                শরহে বেকায়ার সার্টিফিকেট এর জন্য প্রযোজ্য।

                                <br />
                                <br />
                                <p className="font mb-2">ভাষা কোর্স চলাকালীন অবস্থায় আপনাকে কুল্যিয়ার (অনার্সের) সার্কুলার দেওয়া হলে তখন কুল্যিয়ার (অনার্সের) জন্য ভর্তি পরীক্ষা দিতে হবে। ভর্তি পরীক্ষায় উত্তীর্ণ হলে ভাষা কোর্স শেষ হলেই আপনি কুল্যিয়াতে ভর্তি হতে পারবেন। উত্তীর্ণ না হলে সেক্ষেত্রে আপনাকে মাহাদ বা ইন্টারমিডিয়েট এ ভর্তি হতে হবে এবং মাহাদ ৩ বছর ধরে পড়তে হবে এবং তখন মাহাদ শেষ করে আপনি সহজেই তখন আর পরীক্ষা দিতে হবেনা আপনি সরাসরি কুল্যিয়াতে ভর্তি হতে পারবেন।</p>

                                <br />
                                <p className="font mb-2">বি.দ্র: ভাষা কোর্স শেষ করতে যদি কুল্লিয়ার গ্যাপ হয়ে যায় তবুও ভাষা কোর্স শেষ করতে হবে এবং পরের বছর কুল্লিয়াতে ভর্তি হতে হবে ভাষা কোর্স বাধ্যতামূলক</p>

                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary">আলিম পাশ</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                শরহে বেকায়ার সার্টিফিকেট এর জন্য প্রযোজ্য।

                                <br />
                                <br />
                                <p className="font mb-2">ভাষা কোর্স চলাকালীন অবস্থায় আপনাকে কুল্যিয়ার (অনার্সের) সার্কুলার দেওয়া হলে তখন কুল্যিয়ার (অনার্সের) জন্য ভর্তি হতে হবে এর জন্য কোন ভর্তি পরীক্ষার প্রয়োজন হবে না।</p>

                                <br />
                                <p className="font mb-2">বি.দ্র: ভাষা কোর্স শেষ করতে যদি কুল্যিয়ার গ্যাপ হয়ে যায় তবুও ভাষা কোর্স শেষ করতে হবে এবং পরের বছর কুল্লিয়াতে ভর্তি হতে হবে ভাষা কোর্স বাধ্যতামূলক</p>

                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary">আলিম গ্যাপ বেশি হলে</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                আলিমের সার্টিফিকেট এর পাশের সন এবং বর্তমান শিক্ষাবর্ষের সন এর মধ্যেকার গ্যাপ ০৩ বছরের বেশি হলে:
                                <br />
                                <br />
                                <p className="font mb-2">ভাষা কোর্স চলাকালীন অবস্থায় আপনাকে কুল্যিয়ার (অনার্সের) সার্কুলার দেওয়া হলে তখন কুল্যিয়ার (অনার্সের) জন্য ভর্তি পরীক্ষা দিতে হবে। ভর্তি পরীক্ষায় উত্তীর্ণ হলে ভাষা কোর্স শেষ হলেই আপনি কুল্যিয়াতে ভর্তি হতে পারবেন। উত্তীর্ণ না হলে সেক্ষেত্রে আপনাকে মাহাদ বা ইন্টারমিডিয়েট এ ভর্তি হতে হবে এবং সেটি মাহাদ ৩ বছর ধরে পড়তে হবে এবং তখন মাহাদ শেষ করে আপনি সহজেই তখন আর পরীক্ষা দিতে হবেনা আপনি সরাসরি কুল্যিয়াতে ভর্তি হতে পারবেন।</p>

                                <br />
                                <p className="font mb-2">বি.দ্র: ভাষা কোর্স শেষ করতে যদি কুল্লিয়ার গ্যাপ হয়ে যায় তবুও ভাষা কোর্স শেষ করতে হবে এবং পরের বছর কুল্লিয়াতে ভর্তি হতে হবে ভাষা কোর্স বাধ্যতামূলক</p>

                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary">মাস্টার্স</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                আল আযহার বিশ্ববিদ্যালয়ে কেউ অনার্স না করলে সে আল আযহার বিশ্ববিদ্যালয়ে মাস্টার্স করতে পারবেনা।
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary">জেনারেল</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                আমাদের ইসলামিক বিষয় ছাড়া অন্য কোন বিষয়ের উপর কোন কার্যক্রম নেই। তাছাড়া আপনি যদি জেনেরাল বিষয়ে আল আযহার বিশ্ববিদ্যালয়ে পড়াশোনা করতে চান সেক্ষেত্রে প্রতি বছর ৬০০০ ডলার খরচ করতে হবে। সাধারণত আমরা জেনারেল থেকে আল আযহার বিশ্ববিদ্যালয়ে পড়ার জন্য নিরুৎসাহিত করে থাকি।
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary">মেয়ে</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                মেয়েদের ক্ষেত্রে অবশ্যই একজন মাহরাম থাকতে হবে যে আল আযহারে ভর্তি থেকে শুরু করে হোস্টেল এ উঠিয়ে দিয়ে আসা পর‌্যন্ত থাকতে হবে। এবং হোস্টেল এ ইন্দোনেশিয়ান মেয়েদের সাথে বসবাস করতে হবে। সাধারণত আল আযহারে মেয়ারা তাদের হাজবেন্ডদের সাথেই থাকে।
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary">ইকামাহ</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                ২৩০ ডলার নিয়ে যেই ইকামাহ নেওয়া হয় তার মেয়াদ ৬-৮ মাস পরবর্তীতে আল আযহার বিশ্ববিদ্যালয়ে ভর্তি হওয়ার পর আল আযহার বিশ্ববিদ্যালয় থেকেই রেসিডেন্সিয়াল কার্ড দিয়ে দেওয়া হয়।
                            </p>
                        </div>
                        <div className="bg-white shadow-md rounded-3xl p-8 mb-8">

                            <div className="flex items-center justify-center">
                                <h3 className="text-xl px-10 py-1 text-center font-bold bg-primary text-white border border-opacity-10 rounded-md mb-5 border-primary">১৮ বছরের নিচে</h3>
                            </div>
                            {/* <hr className="mb-5" /> */}

                            <p className="text-lg text-justify">
                                ১৮ বছরের নিচে হলে অবশ্যই একজন গার্জিয়ান থাকতে হবে যে আল আযহারে ভর্তি থেকে শুরু করে হোস্টেল এ উঠিয়ে দিয়ে আসা পর‌্যন্ত থাকতে হবে।
                            </p>
                        </div>
                    </div>
                </div>
            </div>
        </div >
    );
};

export default TermsAndConditions;