// src/components/NoticeSection.tsx
import React from "react";

const NoticeSection: React.FC = () => {
    return (
        <div className="bg-white border-t border-primary border-opacity-10 py-2 overflow-hidden">
            <div className="relative flex items-center">
                <div className="animate-scroll whitespace-nowrap">
                    <span className="text-primary text-lg font-medium mx-4">
                        🚨 জরুরী জ্ঞাতব্য: বর্তমানে আল আযহার বিশ্ববিদ্যালয়ে ভর্তি হতে ইকামাহ নেওয়া
                        জরুরী! তাই ইকামাহ গ্রহণ করতে অতিরিক্ত 230 ডলার খরচ হচ্ছে 🚨
                    </span>
                    <span className="text-primary text-lg font-medium mx-4">
                        🚨 জরুরী জ্ঞাতব্য: বর্তমানে আল আযহার বিশ্ববিদ্যালয়ে ভর্তি হতে ইকামাহ নেওয়া
                        জরুরী! তাই ইকামাহ গ্রহণ করতে অতিরিক্ত 230 ডলার খরচ হচ্ছে 🚨
                    </span>
                    <span className="text-primary text-lg font-medium mx-4">
                        🚨 জরুরী জ্ঞাতব্য: বর্তমানে আল আযহার বিশ্ববিদ্যালয়ে ভর্তি হতে ইকামাহ নেওয়া
                        জরুরী! তাই ইকামাহ গ্রহণ করতে অতিরিক্ত 230 ডলার খরচ হচ্ছে 🚨
                    </span>
                    <span className="text-primary text-lg font-medium mx-4">
                        🚨 জরুরী জ্ঞাতব্য: বর্তমানে আল আযহার বিশ্ববিদ্যালয়ে ভর্তি হতে ইকামাহ নেওয়া
                        জরুরী! তাই ইকামাহ গ্রহণ করতে অতিরিক্ত 230 ডলার খরচ হচ্ছে 🚨
                    </span>
                    <span className="text-primary text-lg font-medium mx-4">
                        🚨 জরুরী জ্ঞাতব্য: বর্তমানে আল আযহার বিশ্ববিদ্যালয়ে ভর্তি হতে ইকামাহ নেওয়া
                        জরুরী! তাই ইকামাহ গ্রহণ করতে অতিরিক্ত 230 ডলার খরচ হচ্ছে 🚨
                    </span>
                    {/* Repeat as needed for seamless scrolling */}
                </div>
            </div>
        </div>
    );
};

export default NoticeSection;
