const UE_ADMIN_FAQ = [
  {
    id: 1,
    category: "UE",
    question_banglish: "package highlight",
    question: `এই প্যাকেজের অন্তর্ভুক্ত সুবিধাগুলো কী কী?`,
    answer: `
    ✅ সরাসরি ফ্লাইট   
    ✅ ওমরাহ ভিসা
    ✅ মিশর ভিসা
    ✅ মিশর ভ্রমণ
    ✅ মক্কা-মদিনার জিয়ারত
    ✅ সকল ট্রান্সপোর্ট সুবিধা
    ✅ মানসম্পন্ন হোটেল
    ✅ দেশীয় খাবার    
    ✅ অভিজ্ঞ গাইড
    ✅ সকল ভ্রমণীয় স্থানের এন্ট্রি ফি

    বিস্তারিত জানুন নিচের লিংকটিতে:
    [https://www.azharitravels.com/package/umrah-and-egypt-package]
    `,
  },
  {
    id: 2,
    category: "UE",
    question_banglish: "hotel bebhosta",
    question: `হোটেল ব্যবস্থা কেমন হবে?`,
    answer: `
    ✅ মিশর হোটেল: ৩-তারকা হোটেল (গিজা এলাকায়, প্রতি রুমে ৪ জন)।  
    ✅ মক্কা-মদিনা: স্ট্যান্ডার্ড মানের হোটেল (মক্কায় ৪০০-৬০০ মিটার - কবুতর চত্বর এর পাশে, মদিনায় ২০০-৪০০ মিটার দূরত্বে, প্রতি রুমে ৪-৫ জন)।`,
  },
  {
    id: 3,
    category: "UE",
    question_banglish: "omrahr jonno barti khoroc lagbe?",
    question: `ওমরাহর জন্য কি কোনো বাড়তি খরচ লাগবে?`,
    answer: `
    না, ওমরাহর জন্য আলাদা কোনো খরচ নেই। ওমরাহর যাবতীয় খরচ প্যাকেজের মধ্যেই অন্তর্ভুক্ত রয়েছে।
    `,
  },
  {
    id: 4,
    category: "UE",
    question_banglish: "sokol fee ontorvukto?",
    question: `মিশর ভ্রমণে কি সকল প্রবেশ ফি অন্তর্ভুক্ত?`,
    answer: `
    হ্যাঁ, সকল স্থানের প্রবেশ ফি অন্তর্ভুক্ত।
    `,
  },
  {
    id: 5,
    category: "UE",
    question_banglish: "spots list",
    question: `কোন ঐতিহাসিক স্থানগুলোতে জিয়ারতের সুযোগ পাবো?`,
    answer: `
    🟠 মিশর ভ্রমণ: 

    🟧 পিরামিড
    🟧 ইজিপ্টিয়ান মিউজিয়াম
    🟧 নীল নদ
    🟧 সালাহ উদ্দিন আয়ুবীর কেল্লা
    🟧 তুর পাহাড়
    🟧 সাক্কারা পরিদর্শন
    🟧 নিল নদ
    🟧 মুহাম্মদ আলী মসজিদ
    🟧 আমর ইবনে আস মসজিদ
    🟧 আল আজহার পার্ক
    🟧 আলেকজান্দ্রিয়ায় ভ্রমণ
    🟧 নবী দানিয়েল (আঃ)
    🟧 আলেকজান্দ্রিয়া বাতিঘর
    🟧 কেল্লা কাইতবাই পরিদর্শন
    🟧 আলেকজান্দ্রিয়া লাইব্রেরী পরিদর্শন
    🟧 সাহারা মরুভূমি

    ⚫ মক্কা জিয়ারত: 
    
    ⬛ নবীজির বাড়ি 
    ⬛ জাবালে সাওর 
    ⬛ হেরা গুহা 
    ⬛ আরাফার ময়দান 
    ⬛ জান্নাতুল মোআল্লা 
    ⬛ মুজদালিফা
    ⬛ জান্নাতুল মোআল্লা
    ⬛ জিন মসজিদ
    ⬛ মিনা

    🟩 মদিনা জিয়ারত: 
    
    ✅ জান্নাতুল বাকী
    ✅ উহুদ পাহাড়
    ✅ খন্দকের ময়দান
    ✅ মাকবারায়ে শোহাদায়ে উহুদ
    ✅ মসজিদে কুবা
    ✅ মসজিদে কিবলাতাইন
    ✅ মসজিদে বেলাল রাযি
    ✅ মসজিদে আবু বকর রাযি
    ✅ মসজিদে গমামাহ
    ✅ মাকবারায়ে শোহাদায়ে উহুদ


    বিস্তারিত জানুন নিচের লিংকটিতে:
    [https://www.azharitravels.com/package/umrah-and-egypt-package]
    `,
  },
  {
    id: 6,
    category: "UE",
    question_banglish: "flight dhoron",
    question: `ফ্লাইটের ধরন কেমন হবে?`,
    answer: `এজিপ্ট এয়ারে সরাসরি (ডাইরেক্ট) ফ্লাইটে যাত্রার ব্যবস্থা থাকবে, যাতে যাত্রীরা আরামে ভ্রমণ করতে পারেন।`,
  },
  {
    id: 7,
    category: "UE",
    question_banglish: "package price",
    question: `প্যাকেজের মূল্য কত?`,
    answer: `
    🟠 প্যাকেজ মূল্য ২,২৫,০০০/- টাকা।
    🟠 স্বামী-স্ত্রীর জন্য জন প্রতি ২,৩৫,০০০/- টাকা। (এক্সট্রা রুমের জন্য)।

    বিস্তারিত জানুন নিচের লিংকটিতে:
    [https://www.azharitravels.com/package/umrah-and-egypt-package]
    `,
  },
  {
    id: 8,
    category: "UE",
    question_banglish: "alada room er bebhosta kora jabe",
    question: `পরিবারের সাথে গেলে কি আলাদা রুমের ব্যবস্থা করা যাবে?`,
    answer: `হ্যাঁ, পরিবারের জন্য আলাদা রুমের ব্যবস্থা করা যেতে পারে। তবে এটি অতিরিক্ত খরচের ওপর নির্ভর করবে।  `,
  },
  {
    id: 9,
    category: "UE",
    question_banglish: "kotodin age booking dite hobe?",
    question: `কতদিন আগে বুকিং দিতে হবে?`,
    answer: `যাত্রার তারিখের কমপক্ষে ১-২ মাস আগে বুকিং দেওয়া উত্তম, যাতে সব প্রক্রিয়া যথাযথভাবে সম্পন্ন করা যায়। `,
  },
  {
    id: 10,
    category: "UE",
    question_banglish: "kivabe booking korbo?",
    question: `কীভাবে বুকিং করবো?`,
    answer: `বুকিং করতে আমাদের অফিসে আসতে পারেন অথবা ফোনে যোগাযোগ করে বুকিং নিশ্চিত করতে পারেন। `,
  },
  {
    id: 11,
    category: "UE",
    question_banglish: "ei sofor ki baccader jonno upojukto",
    question: `এই সফর কি বাচ্চাদের জন্য উপযুক্ত?`,
    answer: `হ্যাঁ, তবে যেহেতু অনেক জায়গায় হাঁটতে হবে, তাই ৫ বছরের কম বয়সী শিশুদের নিয়ে গেলে বিশেষ যত্ন নিতে হবে।  `,
  },
  {
    id: 12,
    category: "UE",
    question_banglish: "mohilader jonno  bishesh kono bebhosta ase?",
    question: `মহিলাদের জন্য কোনো বিশেষ ব্যবস্থা আছে কি?`,
    answer: `হ্যাঁ, মহিলাদের জন্য আলাদা মুয়াল্লিম এবং গাইডের ব্যবস্থা থাকবে, যাতে তারা স্বাচ্ছন্দ্যে ইবাদত ও ভ্রমণ করতে পারেন। `,
  },
  {
    id: 13,
    category: "UE",
    question_banglish: "package price poriborton hote pare",
    question: `প্যাকেজ মূল্য কি পরিবর্তন হতে পারে?`,
    answer: `হ্যাঁ, বিমান ভাড়া, হোটেল চার্জ ও ডলার রেটের ওঠানামার কারণে প্যাকেজের মূল্য পরিবর্তন হতে পারে। তবে বুকিং নিশ্চিত হলে মূল্য পরিবর্তনের কোনো ঝামেলা থাকবে না।  `,
  },
  {
    id: 14,
    category: "UE",
    question_banglish: "omrah soforer jonno kono islami guideline dewa hobe?",
    question: `ওমরাহ সফরের জন্য কি কোনো ইসলামী গাইডলাইন দেওয়া হবে?`,
    answer: `হ্যাঁ, সফরের আগে ওমরাহ ও জিয়ারত সম্পর্কিত একটি সংক্ষিপ্ত গাইডলাইন দেওয়া হবে এবং আমাদের সাথে অভিজ্ঞ মুয়াল্লিম থাকবেন। `,
  },
  {
    id: 15,
    category: "UE",
    question_banglish: "kono somossa hole kar sathe jogajog korbo",
    question: `কোনো সমস্যা হলে কার সাথে যোগাযোগ করবো?`,
    answer: `আমাদের ট্রিপ ম্যানেজার ও গাইড সার্ভিস সবসময় আপনার সহায়তায় থাকবে। জরুরি প্রয়োজনে আমাদের হটলাইন নম্বরে যোগাযোগ করতে পারবেন। `,
  },
  {
    id: 16,
    category: "UE",
    question_banglish: "processing korte koto somoi lagbe",
    question: `
    ওমরাহ ও মিশর ভ্রমণ করতে ইচ্ছুক হলে কতদিন লাগবে প্রসেসিং হতে?
    `,
    answer: `
    🟧 প্রায় ১ মাস সময় লাগবে 
    🟧 তবে আমাদেরকে অবশ্যই কমপক্ষে ১ মাস আগে কনফার্ম করতে হবে
`,
  },
  {
    id: 17,
    category: "UE",
    question_banglish: "ki visa and meyad kotodin",
    question: `
    ওমরাহ ও মিশর ভ্রমণের যেই ভিসা দেওয়া হবে সেটা কি ধরণের ভিসা এবং কতদিন মেয়াদ?
    `,
    answer: `
    🟧 মিশর ভিসা ধরণ: অন এরাইভেল ভিসা (তবে কায়রো এয়ারপোর্টে ২৫ ডলার পে করে মিশরের স্টিকার ভিসা লাগিয়ে নিতে হবে)
    🟧 মিশর ভিসা মেয়াদ: মেয়াদ ১ মাস

    🟩 ওমরাহ ভিসা ধরণ: ই ভিসা (সাউদি ওমরাহ ভিসা)
    🟩 ওমরাহ ভিসা মেয়াদ: মেয়াদ ৩ মাস
     
    
`,
  },
  {
    id: 18,
    category: "UE",
    question_banglish: "umrah ar mishor er jonno ki ki documents pryojon",
    question: `
    ওমরাহ ও মিশর ভ্রমণের জন্য কি কি ডকুমেন্টস প্রয়োজন?
    `,
    answer: `
    🟢 ওমরাহ ও মিশর ভ্রমণের জন্য নিম্নোক্ত ডকুমেন্টস প্রয়োজন:

    ✅ পাসপোর্ট এর স্ক্যান কপি
    ✅ ছবি এক কপি (স্ক্যান কপি)
    ✅ সাউদি ভিসার জন্য বায়োমেট্রিক
    ✅ ম্যানিনটাইজিস ভ্যাক্সিন
  `,
  },
  {
    id: 19,
    category: "UE",
    question_banglish: "omrah er jonno kon dhoroner posak nite hobe?",
    question: `
    ওমরাহ এর জন্য কোন ধরনের পোশাক নিতে হবে?
    `,
    answer: `
    📌 পুরুষদের জন্য: ইহরাম (সাদা দুই টুকরো কাপড়, স্যান্ডেল)
    📌 মহিলাদের জন্য: ঢিলেঢালা আবায়া বা মোছা কাপড় ও হিজাব
    📌 সাধারণ সময়ের জন্য হালকা পোশাক নেওয়া উচিত, কারণ সৌদি আরব ও মিশরের আবহাওয়া তুলনামূলক গরম।"
`,
  },
  {
    id: 20,
    category: "UE",
    question_banglish: "payment er process ki?",
    question: `পেমেন্ট এর প্রসেস কী?`,
    answer: `
    🟢 পেমেন্ট এর প্রসেসিং নিম্নে দেওয়া হলো:

    ✅ ১ম ধাপ: প্রথমেই ৫০ হাজার টাকা বুকিং মানি অগ্রিম প্রদান করতে হবে। 
    ✅ ২য় ধাপ: ওমরাহ ভিসা, এয়ার টিকিট এর PNR বুঝে পেয়ে ১ লক্ষ টাকা পরিশোধ করতে হবে।
    ✅ ৩য় ধাপ: মিশরের এপ্রুভাল এবং টিকেট বুঝে পেয়ে বাকি টাকা পরিশোধ করতে হবে।
`,
  },
  {
    id: 21,
    category: "UE",
    question_banglish:
      "husband wife er jonno alada room nite extra koto taka lagbe",
    question: `
    স্বামী-স্ত্রী এর জন্য আলাদা রুম নিতে হলে অতিরিক্ত কত টাকা পরিশোধ করতে হবে।
    `,
    answer: `
    স্বামী-স্ত্রী এর আলাদা রুমের জন্য অতিরিক্ত ১০ হাজার টাকা প্রদান করতে হবে। জন প্রতি ২ লক্ষ ৩৫ হাজার টাকা হবে। 
    `,
  },
  {
    id: 22,
    category: "UE",
    question_banglish: "omrah and misor vromoner somoi sima koidin?",
    question: `
    ওমরাহ এবং মিশর ভ্রমণের মোট সময়সীমা কয়দিন?
    `,
    answer: `
    🟢 ওমরাহ এবং মিশর ভ্রমণের মোট সময়সীমা ১৫দিন:
    
    ✅ মিশরে ৫ দিন
    ✅ মক্কায় ৬ দিন
    ✅ মদিনায় ৩ দিন

    `,
  },
  {
    id: 23,
    category: "UE",
    question_banglish: "single omrah visa prodan kora hoi",
    question: `
    সিঙ্গেল ওমরাহ ভিসা প্রদান করা হয়?
    `,
    answer: `
    দুঃখিত সিঙ্গেল ওমরাহ ভিসা প্রদান করা হয়না।
    `,
  },
  {
    id: 24,
    category: "UE",
    question_banglish: "misore jatayet bebhosta kmn hobe?",
    question: `
    মিশরে যাতায়াত ব্যবস্থা কেমন হবে?
    `,
    answer: `
    মিশরে হাইস গাড়ি (নন এসি) থাকবে যার মাধ্যমে যাতায়াত করা হবে।
    `,
  },
  {
    id: 25,
    category: "UE",
    question_banglish: "makkah madinai jatayet bebhosta kemon hobe?",
    question: `
    মক্কা মদিনায় যাতায়াত ব্যবস্থা কেমন হবে?
    `,
    answer: `
    মক্কা মদিনায় বাস (এসি) থাকবে যার মাধ্যমে যাতায়াত করা হবে।
    `,
  },
  {
    id: 26,
    category: "UE",
    question_banglish: "mishorere khabare talika",
    question: `
    🍱 মিশরের খাবারের তালিকা?
    `,
    answer: `
    🟩 সকালের নাস্তা: সেন্ডউইচ, রুটি, ভাজি, ডিম, ফল (ফ্রুটস), ইত্যাদি।
    🟩 দুপুরের খাবার: গরু, মুরগী, বড় মাছ, ডিম ইত্যাদি। 
    `,
  },
  {
    id: 27,
    category: "UE",
    question_banglish: "tur pahare uthte koto ghonta lagbe",
    question: `
    তূর পাহাড় এ উঠতে কত ঘন্টা লাগবে?    
    `,
    answer: `
    তূর পাহাড় এ উঠতে ৩-৪ ঘন্টা লাগবে।
    `,
  },
  {
    id: 28,
    category: "UE",
    question_banglish: "hotel er cobi ki dekha jabe?",
    question: `
    হোটেল এর ছবি কি দেখা যাবে?
    `,
    answer: `
    জ্বী, টাকা পরিশোধের পর হোটেল এর ছবি দেখা যাবে।
    `,
  },
  {
    id: 29,
    category: "UE",
    question_banglish: "bangladesh tike misor koto keji jinish newa jabe?",
    question: `
    বাংলাদেশ থেকে মিশর কত কেজি জিনিস পত্র নেওয়া যাবে?
    `,
    answer: `
    দুই ব্যাগে ২৩ + ২৩ = ৪৬ কেজি এবং হ্যান্ড ব্যাগে ৭ কেজি জিনিসপত্র নেওয়া যাবে।
    `,
  },
  {
    id: 30,
    category: "UE",
    question_banglish: "mishor tike soudi koto kegi jinish newa jabe?",
    question: `
    মিশর থেকে সৌদি আরব কত কেজি জিনিস পত্র নেওয়া যাবে?
    `,
    answer: `
    দুই ব্যাগে ২৩ + ২৩ = ৪৬ কেজি এবং হ্যান্ড ব্যাগে ৭ কেজি জিনিসপত্র নেওয়া যাবে।
    `,
  },
  {
    id: 31,
    category: "UE",
    question_banglish:
      "saudi arab tike bangladesh e koto kegi jinish potro newa jabe",
    question: `
    সৌদি আরব থেকে বাংলাদেশে কত কেজি জিনিস পত্র নেওয়া যাবে?
    `,
    answer: `
    দুই ব্যাগে ২৩ + ২৩ = ৪৬ কেজি এবং হ্যান্ড ব্যাগে ৭ কেজি জিনিসপত্র নেওয়া যাবে।
    `,
  },
  {
    id: 32,
    category: "UE",
    question_banglish: "bangladesh tike mishor koto kg jinish potro newa jabe?",
    question: `
    বাংলাদেশ থেকে মিশর কত কেজি জিনিস পত্র নেওয়া যাবে?
    `,
    answer: `
    দুই ব্যাগে ২৩ + ২৩ = ৪৬ কেজি এবং হ্যান্ড ব্যাগে ৭ কেজি জিনিসপত্র নেওয়া যাবে।
    `,
  },
  {
    id: 33,
    category: "UE",
    question_banglish: "mishor and omrah er air ki hobe?",
    question: `
    মিশর এবং ওমরাহ এর এয়ার কি হবে?
    `,
    answer: `
    মিশর এবং ওমরাহ এর ইজিপ্ট এয়ার হবে। ডিরেক্ট (সরাসরি) ফ্লাইট।
    `,
  },
  {
    id: 34,
    category: "UE",
    question_banglish: "makkah modiani ki dhoroner khabar takbe",
    question: `মক্কা মদিনায় কি ধরনের খাবার থাকবে?`,
    answer: `
    🍱দেশী খাবার থাকবে:
    গরু, মুরগী, মাছ, ডিম ইত্যাদি।
    `,
  },
  {
    id: 35,
    category: "UE",
    question_banglish: "makka tike madinai jatayet maddhom?",
    question: `
    মক্কা থেকে মদিনার যাতায়াত মাধ্যম?
    `,
    answer: `
    মক্কা থেকে মদিনায় বাসের মাধ্যমে যাতায়াত করা হবে।
    `,
  },
  {
    id: 36,
    category: "UE",
    question_banglish: "koto vori shorno ana jabe?",
    question: `
    সৌদি আরব থেকে কত ভরি স্বর্ণ আনা যাবে?
    `,
    answer: `
    ১০ ভরি স্বর্ণ আনা যাবে?
    `,
  },
];

export default UE_ADMIN_FAQ;
