const AU_ADMIN_FAQ = [
  {
    id: 1,
    category: "UA",
    question_banglish: "initial message",
    question: `এই প্যাকেজের অন্তর্ভুক্ত সুবিধাগুলো কী কী?`,
    answer: `
আসসালামু আলাইকুম, জনাব!

আল আযহার বিশ্ববিদ্যালয়ের ভর্তি প্যাকেজ এখন মাত্র ১,১৫,০০০ টাকা।
(১ম মাসের বাসা ভাড়া, ইকামাহ ও যাতায়াতসহ ১ লক্ষ ৬০ হাজার টাকা)

বিস্তারিত জানতে ভিজিট করুন:
[https://www.azharitravels.com/package/student-package]




আমরা কি আপনাকে ভর্তি প্রক্রিয়ার জন্য যা লাগবে তার তালিকা প্রদান করতে পারি?
    `,
  },
  {
    id: 2,
    category: "UA",
    question_banglish: "qualification",
    question: `যোগ্যতা?`,
    answer: `
ভর্তি প্রক্রিয়ার জন্য যা যা লাগবে, তার তালিকা রইলো:

🌟 পাসপোর্ট 
🌟 পুলিশ ক্লিয়ারেন্স 
🌟 জন্ম নিবন্ধন সার্টিফিকেট (অনলাইন কপি)
🌟 শরহে বেকায়া বা আলিমের সার্টিফিকেট (নোটারী মিনিস্ট্রি) (মনে রাখবেন, পরীক্ষায় সকল বিষয়ে পাশ মার্কস থাকতে হবে এবং শরহে বেকায়ার ক্ষেত্রে বোর্ড সার্টিফিকেট অথবা মাদ্রাসার শরহে বেকায়ার সার্টিফিকেট!)



আমরা কি আপনাকে আমাদের অফিসের ঠিকানা প্রদান করতে পারি?

`,
  },
  {
    id: 3,
    category: "UA",
    question_banglish: "office",
    question: `অফিস`,
    answer: `
📍  পার্মানেন্ট অফিস ঠিকানা:
📞 মোবাইল: 013 1818 5954
🌐 ওয়েবসাইট: [azharitravels.com](https://www.azharitravels.com)
📌 অফিস ম্যাপ: [https://maps.app.goo.gl/XCGEmDw9jyrYoNh36]
🏚️ ঠিকানা: বাসা #২/এ, রোড #৭, নবীনগর হাউজিং, মোহাম্মাদপুর, ঢাকা ১২০৭



আমরা কি আপনাকে আমাদের প্রসেসিং সম্পর্কে জানাতে পারি বা কিভাবে আমরা কাজ করে থাকি সেই সম্পর্কে জানাতে পারি?

    `,
  },
  {
    id: 4,
    category: "UA",
    question_banglish: "processing",
    question: `আমাদের প্রসেসিং:`,
    answer: `
আমাদের প্রসেসিং:

✅ প্রথম ধাপ:
যদি আপনার কাছে যাবতীয় ডকুমেন্টস প্রস্তুত থাকে, তাহলে প্রথমে আপনাকে ৫০,০০০ টাকা অগ্রিম দিয়ে আপনার মিশরের টিকেট রিজার্ভ করতে হবে

✅ দ্বিতীয় ধাপ:
টিকেট রিজার্ভ হওয়ার পর আপনাকে ৪০,০০০ টাকা প্রদান করতে হবে। এই ধাপে আপনার মিশরের ভিসা এপ্রুভাল নিশ্চিত করা হবে

✅ তৃতীয় ধাপ:
বাকি টাকা পরিশোধ করার পর, পাবেন ওকে টু বোর্ড

✅ চতুর্থ ধাপ:
আপনার নির্দিষ্ট তারিখে ফ্লাইটে মিশরে পৌঁছানোর পর, আমাদের প্রতিনিধি আপনাকে সাদরে গ্রহণ করবেন এবং ভর্তি সংক্রান্ত যাবতীয় কার্যক্রম হাতেকলমে সম্পন্ন করে দিবেন 


আমরা কি আপনাকে আমাদের কোন বিষয়গুলো প্যাকেজের অন্তর্ভূক্ত নয় তা প্রদান করতে পারি?
    `,
  },
  {
    id: 5,
    category: "UA",
    question_banglish: "not included",
    question: `প্রসেসিং এর অন্তর্ভূক্ত নয়:`,
    answer: `
জনাব, আমাদের যেই বিষয়গুলো প্যাকেজের অন্তর্ভূক্ত নয় তার তালিকা নিম্নে দেওয়া হলো:

✈️ কায়রো এয়ারপোর্ট এর ২৫ ডলার:
এই ২৫ ডলার আপনাকে নিজেই পরিশোধ করতে হবে।

💵 ভর্তির জন্য ইকামাহ:
ভর্তির প্রক্রিয়ায় নিশ্চিততার জন্য আপনাকে ২৩০ ডলার ইকামাহ নিজে থেকেই পরিশোধ করতে হবে। 

🚌 ভর্তির জন্য যাতায়াত খরচ:
মিশরে পৌঁছানোর ও ভর্তি সংক্রান্ত যাতায়াত খরচ আপনার নিজস্ব ব্যয়ে পূরণ করতে হবে।

🏠 বাসা ভাড়া খরচ:
প্রথম মাসে বাসার জন্য (খাওয়া, দাওয়া, এডভান্স, যাতায়াত, ইত্যাদি সহ) আনুমানিক ৭-১০ হাজার টাকা খরচ হতে পারে। পরবর্তী মাস থেকে, যদি মধ্যম পন্থা অবলম্বন করেন, তাহলে শুধুমাত্র খাওয়া-দাওয়া-যাতায়াত ইত্যাদির জন্য প্রায় ৭-১০ হাজার টাকা খরচ হবে।



আমরা কি আপনাকে শিক্ষা ফি, স্কলারশিপ ও কাজ করার সুযোগ সম্পর্কে জানাতে পারি?
    `,
  },
  {
    id: 6,
    category: "UA",
    question_banglish: "scholarship",
    question: `স্কলারশিপ ও খরচ:`,
    answer: `
🎓 শিক্ষা ফি ও বেতন:
আল আযহার বিশ্ববিদ্যালয়ে ইসলামিক বিষয় যেমন কোরআন শিক্ষা (মুখস্থকরণ ও তাজ্বিদ), তাফসীর, হাদিস, ফিকাহ (ইসলামিক আইন), আকীদাহ (ইসলামিক বিশ্বাস), ইসলামিক ইতিহাস, আরবি ভাষা ও সাহিত্য, সুফিজম (ইসলামী আধ্যাত্মিকতা) ইত্যাদি পড়ার জন্য কোনো টিউশন ফি বা বেতন দিতে হয় না।
শুধুমাত্র আপনার 🍽️ খাওয়া-দাওয়ার ব্যয় নিজে বহন করতে হবে।

📚 স্কলারশিপ:

স্কলারশিপ পাওয়া সম্পূর্ণভাবে 🍀 ভাগ্য ও 🧠 মেধার বিষয়।
ধারাবাহিকভাবে ২-৩ বছর কঠোর পরিশ্রম ও ট্রাই করতে হবে।
শুধুমাত্র মেধাবী ও ভালো ফলাফলের অধিকারী ছাত্রদেরই স্কলারশিপ দেওয়া হয়।

💼 কাজ করার সুযোগ:

পড়ালেখার পাশাপাশি কাজ করার কোনো সুযোগ নেই বা খুবই সীমিত।
অনেকেই টুকিটাকি কাজ করে থাকলেও, কাজ করলে আপনার পড়ালেখার উপর প্রভাব পড়তে পারে, যা ভবিষ্যতে আপনার কাঙ্ক্ষিত লক্ষ থেকে সরে যেতে পারে।



আমরা কি আপনাকে ভর্তির প্রাথমিক ধাপ সম্পর্কে জানাতে পারি?
`,
  },
  {
    id: 7,
    category: "UA",
    question_banglish: "admissio details",
    question: `ভর্তি বিস্তারিত`,
    answer: `
🎓 ভাষা কোর্সে ভর্তি ও প্রাথমিক ধাপ:
ইকামাহ নেওয়ার পর, আপনাকে প্রথমেই ভাষা কোর্সে ভর্তি হতে হবে। এ ক্ষেত্রে আপনার কাছে দুটি অপশন রয়েছে:

1️⃣ আল আযহারের গণ শিক্ষাক্রম:

এখানে আপনি ফ্রিতে ভাষা কোর্সটি করতে পারবেন।
কোর্সটি মোট ৬ সেমিস্টার (৬ মুসতাওয়া) পর্যন্ত চলবে; প্রতি সেমিস্টারের সময়কাল ২ মাস।
আপনার আরবি ভাষার যোগ্যতার উপর নির্ভর করে যেকোন একটি সেমিস্টারে ভর্তি দিবে (যোগ্যতা অনুযায়ী কখনো ৪ সেমিস্টার অথবা ৫সেমিস্টার আবার কখনো ১ সেমিস্টার ও আপনাকে ভর্তি হতে পারে)।
ভাষা কোর্সের আগে আপনাকে একটি ইন্টারভিউ নিবে সেখানে নাহু, সরফ ইত্যাদি বিষয়ে প্রশ্ন করা হবে সেটার সাপেক্ষেই আপনাকে সেমিস্টার এ ভর্তি হতে হবে।
কোর্সটি বাধ্যতামূলক, অর্থাৎ, ইয়ার গ্যাপ হোক বা না হোক—অবশ্যই শেষ করতে হবে।

2️⃣ শেখ যায়েদ (প্রাইভেট শাখা):

বিকল্প হিসেবে, আপনি শেখ যায়েদ শাখাতেও ভর্তি হতে পারেন।
এই শাখায় সেমিস্টারের ধরন প্রাইভেট।



আপনার কি আলিমের সার্টিফিকেট অথবা শরহে বেকায়ার সার্টিফিকেট?
    `,
  },
  {
    id: 8,
    category: "UA",
    question_banglish: "sorhe bekaya",
    question: `শরহে বেকায়া`,
    answer: `
শরহে বেকায়ার সার্টিফিকেট এর জন্য প্রযোজ্য। 
    
ভাষা কোর্স চলাকালীন অবস্থায় আপনাকে কুল্যিয়ার (অনার্সের) সার্কুলার দেওয়া হলে তখন কুল্যিয়ার (অনার্সের) জন্য ভর্তি পরীক্ষা দিতে হবে। ভর্তি পরীক্ষায় উত্তীর্ণ হলে ভাষা কোর্স শেষ হলেই আপনি কুল্যিয়াতে ভর্তি হতে পারবেন। উত্তীর্ণ না হলে সেক্ষেত্রে আপনাকে মাহাদ বা ইন্টারমিডিয়েট এ ভর্তি হতে হবে এবং মাহাদ ৩ বছর ধরে পড়তে হবে এবং তখন মাহাদ শেষ করে আপনি সহজেই তখন আর পরীক্ষা দিতে হবেনা আপনি সরাসরি কুল্যিয়াতে ভর্তি হতে পারবেন। 

বি.দ্র: ভাষা কোর্স শেষ করতে যদি কুল্লিয়ার গ্যাপ হয়ে যায় তবুও ভাষা কোর্স শেষ করতে হবে এবং পরের বছর কুল্লিয়াতে ভর্তি হতে হবে ভাষা কোর্স বাধ্যতামূলক



আপনি কুল্যিয়াতে (অনার্সে) আপনার পছন্দ বিষয় নিয়ে পড়াশোনা করতে চানা?
    `,
  },
  {
    id: 10,
    category: "UA",
    question_banglish: "alim",
    question: `আলিম পাশ হলে`,
    answer: `
ভাষা কোর্স চলাকালীন অবস্থায় আপনাকে কুল্যিয়ার (অনার্সের) সার্কুলার দেওয়া হলে তখন কুল্যিয়ার (অনার্সের) জন্য ভর্তি হতে হবে এর জন্য কোন ভর্তি পরীক্ষার প্রয়োজন হবে না।

বি.দ্র: ভাষা কোর্স শেষ করতে যদি কুল্যিয়ার গ্যাপ হয়ে যায় তবুও ভাষা কোর্স শেষ করতে হবে এবং পরের বছর কুল্লিয়াতে ভর্তি হতে হবে ভাষা কোর্স বাধ্যতামূলক



আপনি কুল্যিয়াতে (অনার্সে) আপনার পছন্দ বিষয় নিয়ে পড়াশোনা করতে চানা?

    `,
  },
  {
    id: 10,
    category: "UA",
    question_banglish: "subject choice",
    question: `আলিম পাশ হলে`,
    answer: `
কুল্যিয়াতে (অনার্সে) ১ম দুই বছর সকল বিষয় এর উপর পড়াশোনা করতে হবে। আপনি যেই বিষয়টি পড়াশোনা করতে চাচ্ছেন সেই বিষয়টির উপর বিগত পরীক্ষায় মুমতায হলে আল আযহার বিশ্ববিদ্যালয় কর্তৃপক্ষ সেই বিষয়টি নিয়ে পড়ার সুযোগ দিলে সেই বিষয়টি নিয়ে পড়াশোনা করতে পারবেন।
    `,
  },
  {
    id: 9,
    category: "UA",
    question_banglish: "alim gap beshi hole",
    question: `আলিম গ্যাপ বেশি হলে`,
    answer: `
আলিমের সার্টিফিকেট এর পাশের সন এবং বর্তমান শিক্ষাবর্ষের সন এর মধ্যেকার গ্যাপ ০৩ বছরের বেশি হলে:

ভাষা কোর্স চলাকালীন অবস্থায় আপনাকে কুল্যিয়ার (অনার্সের) সার্কুলার দেওয়া হলে তখন কুল্যিয়ার (অনার্সের) জন্য ভর্তি পরীক্ষা দিতে হবে। ভর্তি পরীক্ষায় উত্তীর্ণ হলে ভাষা কোর্স শেষ হলেই আপনি কুল্যিয়াতে ভর্তি হতে পারবেন। উত্তীর্ণ না হলে সেক্ষেত্রে আপনাকে মাহাদ বা ইন্টারমিডিয়েট এ ভর্তি হতে হবে এবং সেটি মাহাদ ৩ বছর ধরে পড়তে হবে এবং তখন মাহাদ শেষ করে আপনি সহজেই তখন আর পরীক্ষা দিতে হবেনা আপনি সরাসরি কুল্যিয়াতে ভর্তি হতে পারবেন। 

বি.দ্র: ভাষা কোর্স শেষ করতে যদি কুল্লিয়ার গ্যাপ হয়ে যায় তবুও ভাষা কোর্স শেষ করতে হবে এবং পরের বছর কুল্লিয়াতে ভর্তি হতে হবে ভাষা কোর্স বাধ্যতামূলক



আপনি কুল্যিয়াতে (অনার্সে) আপনার পছন্দ বিষয় নিয়ে পড়াশোনা করতে চানা?
    `,
  },

  {
    id: 11,
    category: "UA",
    question_banglish: "masters",
    question: `মাস্টার্স`,
    answer: `
দুঃখিত জনাব, 

আল আযহার বিশ্ববিদ্যালয়ে কেউ অনার্স না করলে সে আল আযহার বিশ্ববিদ্যালয়ে মাস্টার্স করতে পারবেনা।
`,
  },
  {
    id: 12,
    category: "UA",
    question_banglish: "general",
    question: `জেনারেল`,
    answer: `
দুঃখিত জনাব, 

আমাদের ইসলামিক বিষয় ছাড়া অন্য কোন বিষয়ের উপর কোন কার্যক্রম নেই। তাছাড়া আপনি যদি জেনেরাল বিষয়ে আল আযহার বিশ্ববিদ্যালয়ে পড়াশোনা করতে চান সেক্ষেত্রে প্রতি বছর ৬০০০ ডলার খরচ করতে হবে। সাধারণত আমরা জেনারেল থেকে আল আযহার বিশ্ববিদ্যালয়ে পড়ার জন্য নিরুৎসাহিত করে থাকি।
`,
  },
  {
    id: 13,
    category: "UA",
    question_banglish: "girl",
    question: `মেয়ে`,
    answer: `
মেয়েদের ক্ষেত্রে অবশ্যই একজন মাহরাম থাকতে হবে যে আল আযহারে ভর্তি থেকে শুরু করে হোস্টেল এ উঠিয়ে দিয়ে আসা পর‌্যন্ত থাকতে হবে। এবং হোস্টেল এ ইন্দোনেশিয়ান মেয়েদের সাথে বসবাস করতে হবে। সাধারণত আল আযহারে মেয়ারা তাদের হাজবেন্ডদের সাথেই থাকে। 
`,
  },
  {
    id: 13,
    category: "UA",
    question_banglish: "ikamah",
    question: `ইকামাহ`,
    answer: `
২৩০ ডলার নিয়ে যেই ইকামাহ নেওয়া হয় তার মেয়াদ ৬-৮ মাস পরবর্তীতে আল আযহার বিশ্ববিদ্যালয়ে ভর্তি হওয়ার পর আল আযহার বিশ্ববিদ্যালয় থেকেই রেসিডেন্সিয়াল কার্ড দিয়ে দেওয়া হয়। 
    `,
  },
  {
    id: 14,
    category: "UA",
    question_banglish: "under 18",
    question: `১৮ বছরের নিচে`,
    answer: `
১৮ বছরের নিচে হলে অবশ্যই একজন গার্জিয়ান থাকতে হবে যে আল আযহারে ভর্তি থেকে শুরু করে হোস্টেল এ উঠিয়ে দিয়ে আসা পর‌্যন্ত থাকতে হবে। 
`,
  },
  {
    id: 15,
    category: "UA",
    question_banglish: "jazakallah",
    question: `জাযাকাল্লাহ`,
    answer: `
জাযাকাল্লাহ জনাব, আযহারী ট্রাভেলসের সাথেই থাকবেন।

[https://www.azharitravels.com/]
`,
  },
  {
    id: 15,
    category: "UA",
    question_banglish: "bannk",
    question: `bank`,
    answer: `
Bank Name : Islami Bank Bangladesh Ltd. 
Account Name : MUHAMMAD RUMMAN UDDIN 
Account Number : 20507030200184112 
Account Branch Name : Krishi Market, Mohammadpur 
Sub Branch : Nobodoy Bazar Routing 
Mobile Number : 01318185954       

Bank Name : Dutch Bangla Bangladesh Ltd  
Account name : MUHAMMAD RUMMAN UDDIN 
Account number : 2581580059496 
Branch Name : Mohammadpur, Dhaka 
Mobile Number : 01318185954    

Bkash / Nagad : 01318185954
`,
  },
  {
    id: 15,
    category: "UA",
    question_banglish: "routing number",
    question: `routing number`,
    answer: `
Bank Name : Islami Bank Bangladesh Ltd. 
Account Name : MUHAMMAD RUMMAN UDDIN 
Account Number : 20507030200184112 
Account Type : Mudaraba Savings 
Account Branch Name : Krishi Market, Mohammadpur 
Sub Branch : Nobodoy Bazar Routing 
Number : 703 
Mobile Number : 01318185954       

Bank Name : Dutch Bangla Bangladesh Ltd  
Account name : MUHAMMAD RUMMAN UDDIN 
Account number : 2581580059496 
Account type : Savings Account  
Branch Name : Mohammadpur, Dhaka 
Routing Number : 090263286 
Mobile Number : 01318185954    

Bkash / Nagad : 01318185954
`,
  },
];

export default AU_ADMIN_FAQ;
